{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "sitefig.net",
	"language": "en",
	"home_page_url": "https://ww.sitefig.net/",
	"feed_url": "https://ww.sitefig.net/feed/feed.json",
	"description": "Sitefig blog",
	"author": {
		"name": "Len Dierickx",
		"url": "https://sitefig.eu/"
	},
	"items": [
		{
			"id": "https://ww.sitefig.net/blog/webpage-classification/",
			"url": "https://ww.sitefig.net/blog/webpage-classification/",
			"title": "Leveraging WordNet for Web Page Classification Using Semantic Networks",
			"content_html": "<h2 id=\"leveraging-wordnet-for-web-page-classification-using-semantic-networks\" tabindex=\"-1\">Leveraging WordNet for Web Page Classification Using Semantic Networks <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>This blog post is one of many about web page classification and information retrieval algorithms. Most papers are still relevant today, even if it was just to better understand how search engines and AI work today.</p>\n<p><strong>Introduction</strong></p>\n<p>Today, we will be analysing the paper &quot;Web Page Classification Using WordNet's Linguistic Information&quot;  by Eleftherios Kozanidis, Vasiliki Simaki, and Athanasia Koumpouri, who presented an approach on how to use semantic networks and word sense disambiguation technique.</p>\n<p>Word disambiguation is still important today in information retrieval because many words have multiple meanings. For example, the word &quot;bank&quot; can refer to the side of a river or a financial institution. Without disambiguation, a search engine might give you results about riverbanks when you're looking for a bank to open an account.</p>\n<p>Word disambiguation helps search engines understand which meaning of the word you're interested in, based on the context of your search, which is where semantic networks become important.</p>\n<p>In a semantic network, words (or concepts) are connected to each other based on their meanings. For example, in such a network, the word &quot;bank&quot; would be linked to &quot;money,&quot; &quot;finance,&quot; and &quot;ATM&quot; for the financial meaning, and linked to &quot;river,&quot; &quot;water,&quot; and &quot;fishing&quot; for the riverbank meaning.</p>\n<p>Web page classification is crucial in improving information retrieval and organizing content. Automated classification methods are essential as the World Wide Web grows exponentially and content becomes a real asset again. The research paper &quot;Web Page Classification Using WordNet's Linguistic Information&quot; explores the use of semantic networks, particularly WordNet and GreekWordNet, to enhance web page classification. The paper demonstrates how linguistic data, combined with word sense disambiguation (WSD) and semantic similarity measures, can effectively categorize web pages into predefined thematic areas.</p>\n<p>In this post, we will explain the research, explain the methodology, and show how these techniques can be applied in modern applications, with some relevant code examples.</p>\n<hr>\n<h3 id=\"semantic-networks-and-word-sense-disambiguation\" tabindex=\"-1\">Semantic Networks and Word Sense Disambiguation <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h3>\n<p>Semantic networks like WordNet represent concepts (nodes) and the relationships between them (edges). WordNet groups words into sets of cognitive synonyms called <em>synsets</em>, which express distinct concepts.</p>\n<p>WordNet is a specific type of semantic network that groups words with similar meanings into sets called synsets. Each synset represents a specific meaning or idea. For example, in WordNet, the word &quot;bank&quot; might be part of one synset that refers to a place for money and another synset that refers to the side of a river. This helps computers understand which meaning of a word you’re using.</p>\n<p>big problem in sorting text into categories (text classification) is figuring out the right meaning of a word when it has multiple meanings. This is called word sense disambiguation (WSD). It means deciding which meaning of a word fits best based on the words around it.</p>\n<p>In this paper, the authors use a special method called the UMND1 algorithm to solve this. It works by looking at the meanings of the nearby words and finding the one that makes the most sense. It does this by using WordNet’s synsets (groups of words with similar meanings) to calculate how similar the words are in meaning.</p>\n<p>Here's a simple Python example of how WSD might be implemented using the NLTK library's WordNet interface:</p>\n<pre><code>from nltk.corpus import wordnet as wn\nfrom nltk.wsd import lesk\n\n# Sample sentence and ambiguous word\nsentence = &quot;The bank will not approve the loan.&quot;\nambiguous_word = &quot;bank&quot;\n\n# Word sense disambiguation using lesk algorithm\nsense = lesk(sentence.split(), ambiguous_word)\nprint(f&quot;Word: {ambiguous_word}&quot;)\nprint(f&quot;Disambiguated Sense: {sense}&quot;)\nprint(f&quot;Definition: {sense.definition()}&quot;)\n</code></pre>\n<p>This function selects the correct meaning of &quot;bank&quot; based on the sentence. However, the paper uses a more sophisticated approach based on semantic similarity.</p>\n<hr>\n<h3 id=\"semantic-similarity-measures\" tabindex=\"-1\">Semantic Similarity Measures <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h3>\n<p>The authors use two categories of semantic similarity measures: <strong>edge counting measures</strong> and <strong>information content measures</strong>. These measures calculate the closeness of concepts within WordNet's hierarchy. Below are some of the key measures:</p>\n<ol>\n<li><strong>Wu and Palmer (wup)</strong>: Measures similarity based on the depth of the concepts in the taxonomy.</li>\n<li><strong>Leacock and Chodorow (lch)</strong>: Computes the shortest path between two concepts and normalizes it by the maximum depth.</li>\n<li><strong>Resnik</strong>: Measures the shared information between two concepts.</li>\n</ol>\n<p>Here's an example of calculating the Wu and Palmer similarity between two words in Python:</p>\n<pre><code>from nltk.corpus import wordnet as wn\n\n# Words to compare\nword1 = wn.synset('car.n.01')\nword2 = wn.synset('automobile.n.01')\n\n# Calculate Wu-Palmer similarity\nsimilarity = word1.wup_similarity(word2)\nprint(f&quot;Wu-Palmer Similarity between {word1.name()} and {word2.name()}: {similarity}&quot;)\n</code></pre>\n<p>In the study, <strong>co-occurring synsets</strong> provided better classification results, especially when combined with these semantic measures. For example, using the <strong>Jiang and Conrath</strong> similarity measure improved disambiguation accuracy in the experiments.</p>\n<hr>\n<h3 id=\"web-page-classification-algorithm\" tabindex=\"-1\">Web Page Classification Algorithm <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h3>\n<p>The classification algorithm developed in the paper focuses on analyzing anchor text (the clickable text of a hyperlink), as it often provides a concise summary of the linked page's content. The steps involved are:</p>\n<ol>\n<li><strong>Extract anchor text</strong> from the web page.</li>\n<li><strong>Disambiguate terms</strong> using WSD to find the most accurate sense for each word.</li>\n<li><strong>Calculate feature weights</strong> using a variant of the TF-IDF (Term Frequency-Inverse Document Frequency) algorithm to determine the importance of terms.</li>\n<li><strong>Categorize the page</strong> based on the predefined thematic areas using the processed features.</li>\n</ol>\n<p>The TF-IDF variant used here calculates how representative a term is for a particular category, which is crucial for distinguishing content. A Python implementation for basic TF-IDF might look like this:</p>\n<pre><code>from sklearn.feature_extraction.text import TfidfVectorizer\n\n# Example web page anchor texts\ndocuments = [\n&quot;The car is fast and reliable.&quot;,\n&quot;Automobile manufacturing is a key industry.&quot;,\n&quot;Banks offer loans for buying cars.&quot;\n]\n\n# Initialize TF-IDF Vectorizer\nvectorizer = TfidfVectorizer()\ntfidf_matrix = vectorizer.fit_transform(documents)\n\n# Display TF-IDF scores\nfeature_names = vectorizer.get_feature_names_out()\nfor doc_id, doc in enumerate(documents):\nprint(f&quot;\\nDocument {doc_id+1}:&quot;)\nfor word_id in tfidf_matrix[doc_id].nonzero()[1]:\nprint(f&quot;{feature_names[word_id]}: {tfidf_matrix[doc_id, word_id]:.4f}&quot;)\n</code></pre>\n<p>This example shows how TF-IDF helps in feature extraction for classification, giving higher weights to words like &quot;car&quot; and &quot;automobile&quot; in automotive-related documents.</p>\n<hr>\n<h3 id=\"experimental-results\" tabindex=\"-1\">Experimental Results <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h3>\n<p>The paper compares various classification approaches and semantic similarity measures. For English web pages, the best results were obtained using <strong>co-occurring WordNet synsets</strong>, especially when paired with the Leacock-Chodorow and Wu-Palmer measures. The classifier could assign a web page to one of 245 categories with significant accuracy.</p>\n<p>Key findings include:</p>\n<ul>\n<li><strong>Co-occurring synsets</strong> yielded the best classification results.</li>\n<li>Using <strong>disambiguated terms</strong> improved the precision of thematic classification.</li>\n<li>The performance was enhanced by combining different similarity measures and using WordNet's semantic hierarchy.</li>\n</ul>\n<hr>\n<h3 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://ww.sitefig.net/blog/webpage-classification/\">#</a></h3>\n<p>This research demonstrates the power of integrating semantic networks like WordNet with traditional machine-learning techniques for web page classification. By disambiguating word senses and calculating semantic similarity, the classifier provides more accurate results than conventional keyword-based methods.</p>\n<p>Improvements could include:\nExpanding the training data for languages like Greek.\nRefining the disambiguation process.\nIncorporating modern deep learning techniques for better performance.\nNevertheless, leveraging linguistic data for more intelligent web page categorization remains highly relevant in today's AI-driven world.</p>\n<hr>\n<p><strong>References</strong></p>\n<p>[1] Kozanidis, E., Simaki, V., Koumpouri, A. <em>Web Page Classification Using WordNet's Linguistic Information</em>.\n[2] Fellbaum, Ch. (1998). <em>WordNet: An Electronic Lexical Database</em>. MIT Press.\n[3] Qi, X., &amp; Davison, B. (2009). <em>Web Page Classification: Features and Algorithms</em>. ACM Computing Surveys.</p>\n",
			"date_published": "2024-09-20T00:00:00Z"
		}
		
	]
}
