{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "sitefig.net",
	"language": "en",
	"home_page_url": "https://www.sitefig.net/",
	"feed_url": "https://www.sitefig.net/feed/feed.json",
	"description": "Sitefig blog",
	"author": {
		"name": "Len Dierickx",
		"url": "https://sitefig.eu/"
	},
	"items": [
		{
			"id": "https://www.sitefig.net/blog/eaa-getting-ready/",
			"url": "https://www.sitefig.net/blog/eaa-getting-ready/",
			"title": "Why Your Business Must Comply with the European Accessibility Act by 2025: A Complete Guide to Staying Ahead with Sitefig",
			"content_html": "<h2 id=\"what-businesses-need-to-know-and-how-to-prepare-for-2025\" tabindex=\"-1\">What Businesses Need to Know and How to Prepare for 2025 <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<p>As a consultant and Saas founder, I can confidently say that the <a href=\"https://ec.europa.eu/social/main.jsp?catId=1202\">European Accessibility Act (EAA)</a> represents a significant shift in the digital landscape.</p>\n<p>It's not just another regulation; it's a transformative mandate that will reshape how businesses approach digital products.</p>\n<p>The EAA is a game-changer for several reasons:</p>\n<ol>\n<li>It extends accessibility requirements to the private sector, complementing existing legislation like the EU Web Accessibility Directive.</li>\n<li>It harmonizes accessibility standards across the EU, creating a more unified market for accessible products and services.</li>\n<li>It covers a broad range of digital products and services, from e-commerce platforms to smartphones and e-books.</li>\n</ol>\n<h2 id=\"key-implications-for-businesses\" tabindex=\"-1\">Key Implications for Businesses <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<p>My advise to businesses is to focus on the following areas:</p>\n<ol>\n<li><strong>Comprehensive Audits</strong>: Conduct thorough accessibility audits of your digital assets, including websites, mobile apps, and self-service terminals.</li>\n<li><strong>POUR Principles</strong>: Align your accessibility strategy with the POUR principles (Perceivable, Operable, Understandable, Robust) which form the foundation of the Web Content Accessibility Guidelines (WCAG).</li>\n<li><strong>Cross-border Considerations</strong>: For businesses operating in multiple EU countries, pay special attention to language and localization aspects of accessibility.</li>\n</ol>\n<h2 id=\"preparing-for-2025\" tabindex=\"-1\">Preparing for 2025 <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<p>The June 28, 2025 enforcement date may seem distant, but in my experience, businesses often underestimate the time and resources required for full compliance. Here's what I recommend:</p>\n<ol>\n<li>Start early: Begin your accessibility journey now to avoid last-minute scrambles.</li>\n<li>Develop a roadmap: Create a detailed plan for achieving compliance, including milestones and resource allocation.</li>\n<li>Train your team: Invest in accessibility training for your staff, especially developers and content creators.</li>\n<li>Choose the right tools: Utilize accessibility testing tools and platforms to streamline your compliance efforts.</li>\n</ol>\n<h3 id=\"potential-challenges-and-solutions\" tabindex=\"-1\">Potential Challenges and Solutions <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<p>In my consultancy work, I've observed several common challenges:</p>\n<p><strong>Legacy Systems</strong>: Older systems may require significant updates or replacements to meet accessibility standards.</p>\n<p><strong>Solution</strong>: Prioritize updates based on user impact and compliance requirements.</p>\n<p><strong>Resource Constraints</strong>: Smaller businesses may struggle with the resources needed for compliance.</p>\n<p><strong>Solution</strong>: Explore exemptions for micro-enterprises and focus on gradual, prioritized improvements.</p>\n<p><strong>Ongoing Maintenance</strong>: Accessibility is not a one-time fix but requires continuous attention.</p>\n<p><strong>Solution</strong>: Integrate accessibility checks into your regular development and content creation processes.</p>\n<h3 id=\"the-role-of-accessibility-tools\" tabindex=\"-1\">The Role of Accessibility Tools <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<p>Tools like Sitefig can be invaluable in your accessibility journey. They can help you:</p>\n<ol>\n<li>Identify accessibility issues across your digital properties.</li>\n<li>Prioritize fixes based on impact and compliance requirements.</li>\n<li>Monitor ongoing compliance and track progress over time.</li>\n</ol>\n<p>If you have a significant number of websites and applications, you will have to start with automated testing. Preferably, you will use a tool that can identify which pages need manual auditing and can monitor your progress over time.</p>\n<h2 id=\"why-should-businesses-care-about-the-european-accessibility-act\" tabindex=\"-1\">Why Should Businesses Care About the European Accessibility Act? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<ol>\n<li><strong>Legal Obligations and Consequences</strong></li>\n</ol>\n<p>The European Accessibility Act, officially adopted in 2019, becomes enforceable on June 28, 2025.</p>\n<p>From this date, businesses offering services or products in the EU must comply with stringent accessibility requirements. Failure to do so can lead to fines, legal actions, and exclusion from public procurement processes. Penalties for non-compliance vary by country but can reach up to millions of euros depending on the breach's severity and the business's size.</p>\n<ol start=\"2\">\n<li><strong>Inclusion and Market Expansion</strong></li>\n</ol>\n<p>Adhering to the EAA is not just about avoiding penalties; it's about embracing inclusivity. According to <a href=\"https://www.consilium.europa.eu/en/infographics/disability-eu-facts-figures/#:~:text=How%20many%20people%20have%20a,people%20adults%20in%20the%20EU.\">Eurostat, over 27% of the EU population has some form of disability</a>. Ignoring accessibility means limiting your potential market and alienating a significant portion of your audience. By complying with the EAA, you'll open your products and services to more customers, including those with disabilities, temporary impairments, or situational needs.</p>\n<p>3<strong>Competitive Edge and Innovation</strong></p>\n<p>Accessibility can drive innovation. The challenge of designing products and services for all users often leads to new, creative solutions that improve usability for everyone. Businesses that prioritize accessibility from the start will likely stay ahead of competitors, enhance their reputation, and build customer trust.</p>\n<h3 id=\"what-is-the-european-accessibility-act\" tabindex=\"-1\">What is the European Accessibility Act? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<p>The European Accessibility Act (EAA) is a directive to ensure that products and services across the EU are accessible to individuals with disabilities. The EAA applies to various sectors, including digital and physical services, from e-commerce websites to ATMs, ticketing machines, and mobile apps. It harmonizes accessibility standards across EU member states and eliminates barriers from differing national laws.</p>\n<p>Under the EAA, businesses operating in e-commerce, banking, transport, and telecommunications industries must ensure that their digital products, services, and content meet accessibility requirements. The act mandates the integration of accessibility from the design phase, ensuring that products and services are accessible to people with varying disabilities, including those with visual, auditory, motor, or cognitive impairments.</p>\n<h3 id=\"what-businesses-need-to-do-to-comply\" tabindex=\"-1\">What Businesses Need to Do to Comply <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<ol>\n<li><strong>Identify if the EAA Applies to You</strong></li>\n</ol>\n<p>If your company provides services or products within the EU, the EAA likely applies to you. The act targets public and private entities, focusing on key industries like telecommunications, financial services, transport, e-commerce, and digital media. Companies outside the EU offering services or products to EU consumers must also comply.</p>\n<ol>\n<li><strong>Understand What Needs to Be Accessible</strong></li>\n</ol>\n<p>The EAA mandates accessibility for a wide range of products and services, including:</p>\n<ol>\n<li><strong>Websites and mobile apps</strong>: All digital interfaces, from e-commerce platforms to mobile banking apps, must be fully accessible.</li>\n<li><strong>Hardware and software</strong>: Devices such as computers, smartphones, and ATMs must be operable by people with disabilities.</li>\n<li><strong>E-books and media streaming services</strong>: Audiovisual content and e-readers must offer features like subtitles, audio descriptions, and screen-reader compatibility.</li>\n</ol>\n<p>Businesses must ensure their websites and apps are <strong>perceivable, operable, understandable, and robust</strong> per the Web Content Accessibility Guidelines (WCAG) 2.1 AA, the minimum standard for accessibility under the EAA.</p>\n<ol>\n<li><strong>Create an Accessibility Statement</strong></li>\n</ol>\n<p>The EAA requires businesses to publish accessibility statements on their websites, outlining how their products or services meet the required standards. These statements should include:</p>\n<ol>\n<li>Information about the product or service's accessibility features</li>\n<li>Contact details for feedback and support</li>\n<li>Compliance declarations</li>\n</ol>\n<p>This statement should be easily accessible to users and updated regularly.</p>\n<ol>\n<li><strong>Perform an Accessibility Audit</strong></li>\n</ol>\n<p>An accessibility audit is essential to identify existing gaps in compliance. Use automated tools, like Sitefig, to scan your website and digital platforms for broken links, accessibility barriers, and areas of non-compliance. This audit should assess everything from website navigation to content structure and multimedia compatibility.</p>\n<ol>\n<li><strong>Remediate all accessibility issues</strong></li>\n</ol>\n<p>Act on your audit's findings by fixing any accessibility gaps. Addressing these issues, whether broken links, missing alt text, or design flaws, is critical to achieving full compliance and ensuring a seamless user experience for all.</p>\n<h3 id=\"timelines-for-compliance\" tabindex=\"-1\">Timelines for Compliance <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<ol>\n<li><strong>2019</strong>: The EAA was officially adopted by the EU.</li>\n<li><strong>June 28, 2022</strong>: Member states were required to implement the directive into national law.</li>\n<li><strong>June 28, 2025</strong>: Full compliance is mandatory for businesses across the EU.</li>\n</ol>\n<p>As of June 2025, all newly marketed products and services must comply with the EAA's accessibility standards. Businesses should start preparing immediately to avoid a last-minute scramble.</p>\n<h3 id=\"what-are-the-penalties-for-non-compliance\" tabindex=\"-1\">What Are the Penalties for Non-Compliance? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<p>The consequences of failing to meet the EAA's requirements go beyond financial penalties. Here's what your business stands to lose:</p>\n<ol>\n<li><strong>Fines</strong>: Non-compliance can result in substantial financial penalties, ranging from tens of thousands to millions of euros, depending on the jurisdiction and the severity of the breach.</li>\n<li><strong>Legal actions</strong>: Consumers and advocacy groups can take legal action against companies that fail to meet accessibility standards, potentially leading to court cases and reputational damage.</li>\n<li><strong>Loss of contracts</strong>: Inaccessible products and services may be excluded from public procurement and private contracts, leading to a loss of business opportunities.</li>\n<li><strong>Reputational damage</strong>: Companies that fail to prioritize accessibility risk losing customer trust and loyalty.</li>\n</ol>\n<h2 id=\"how-sitefig-can-help-businesses-get-ready\" tabindex=\"-1\">How Sitefig Can Help Businesses Get Ready <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<p>For businesses looking to get ahead of the 2025 deadline, <strong>Sitefig</strong> offers a powerful solution. Sitefig's automated tools help companies identify and fix accessibility issues, ensuring compliance with the EAA's digital accessibility requirements.</p>\n<p>Here's how Sitefig can support your compliance efforts:</p>\n<ol>\n<li><strong>Automated Broken Link Detection</strong>: Sitefig identifies and tracks broken links across your digital platforms, one of the common barriers to accessibility.</li>\n<li><strong>Accessibility Audits</strong>: Sitefig's platform scans your websites and apps, pinpointing areas where you fall short of accessibility standards like WCAG 2.1.</li>\n<li><strong>Actionable Insights</strong>: Sitefig provides clear, actionable steps to resolve accessibility issues, helping your team prioritize fixes and avoid costly penalties.</li>\n<li><strong>Ongoing Monitoring</strong>: Compliance isn't a one-time task. Sitefig continuously monitors your platforms to ensure they remain accessible, even as you update or add new content.</li>\n</ol>\n<p>By incorporating Sitefig into your accessibility strategy, your business can ensure fully prepared for the EAA's compliance deadline in 2025, avoid penalties, and embrace accessibility.</p>\n<h3 id=\"next-steps-for-businesses\" tabindex=\"-1\">Next Steps for Businesses <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h3>\n<p>The clock is ticking. June 2025 may seem far away, but businesses must take immediate action to ensure compliance with the European Accessibility Act. Here's how you can get started:</p>\n<ol>\n<li><strong>Audit your current accessibility</strong>: Use tools like Sitefig to audit your websites comprehensively. Identify areas that fall short of WCAG 2.1 standards and prioritize fixes.</li>\n<li><strong>Train your team</strong>: Accessibility is everyone's responsibility. Ensure your developers, designers, content creators, and project managers understand the importance of digital accessibility and know how to implement best practices.</li>\n<li><strong>Develop an action plan</strong>: Create a roadmap to address accessibility issues across your digital platforms. Set clear deadlines and assign responsibilities to team members to ensure timely compliance.</li>\n<li><strong>Monitor progress</strong>: Implement ongoing monitoring to ensure your products and services remain accessible as you update or expand them. Regularly review your accessibility statement to ensure it reflects the current state of your digital services.</li>\n</ol>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/eaa-getting-ready/\">#</a></h2>\n<p>The European Accessibility Act represents a significant step forward in ensuring equal access to products and services across the EU. For businesses, this is both a challenge and an opportunity. By embracing accessibility, you can expand your market, enhance customer satisfaction, and drive innovation. With the right tools, like Sitefig, and a proactive approach, your business can navigate the complexities of the EAA and emerge stronger, more inclusive, and fully compliant by the June 2025 deadline. Don't wait — start your accessibility journey today.</p>\n",
			"date_published": "2024-09-24T09:11:24Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/webpage-classification/",
			"url": "https://www.sitefig.net/blog/webpage-classification/",
			"title": "Leveraging WordNet for Web Page Classification Using Semantic Networks",
			"content_html": "<p>This blog post is one of many about web page classification and information retrieval algorithms. Most papers are still relevant today, even if it was just to better understand how search engines and AI work today.</p>\n<p><strong>Introduction</strong></p>\n<p>In this post, we will be analysing the paper <a href=\"https://www.academia.edu/5085262/Web_Page_Classification_Using_WordNets_Linguistic_Information\">&quot;Web Page Classification Using WordNet's Linguistic Information&quot;</a>  by Eleftherios Kozanidis, Vasiliki Simaki, and Athanasia Koumpouri, who presented an approach on how to use semantic networks and word sense disambiguation technique.</p>\n<p>Even though today's search engines apply disambiguation to complete sentences and phrases instead of single words, the technique is still useful to learn to better understand how algorithms like BERT are used. So let's get started.</p>\n<p><img src=\"https://www.sitefig.net/img/semantic-network.webp\" alt=\"A network of nodes around the concept of news, a mesh of words that are all linked together to the concept of what news means. AI generated, difficult to read text\"></p>\n<p><strong>Abstract</strong></p>\n<p>A problem in sorting text into categories (text classification) is figuring out the right meaning of a word when it has multiple meanings. This is called word sense disambiguation (WSD). It means deciding which meaning of a word fits best based on the surrounding words.</p>\n<p>Semantic similarity and determining the actual meaning of a word in context has always been problematic in computational linguistic and machine learning.</p>\n<p>Word disambiguation in information retrieval can be tricky, because many words have multiple meanings. For example, the word &quot;bank&quot; can refer to the side of a river or a financial institution. Without disambiguation, a search engine might give you results about riverbanks when you're looking for a bank to open an account.</p>\n<p>Word disambiguation helps search engines understand which meaning of the word you're interested in, based on the context of your search, which is where semantic networks become important.</p>\n<p>In a semantic network, words (or concepts) are connected to each other based on their meanings. For example, in such a network, the word &quot;bank&quot; would be linked to &quot;money,&quot; &quot;finance,&quot; and &quot;ATM&quot; for the financial meaning, and linked to &quot;river,&quot; &quot;water,&quot; and &quot;fishing&quot; for the riverbank meaning.</p>\n<p>Web page classification is crucial in improving information retrieval and organizing content. Automated classification methods are essential as the World Wide Web grows exponentially and content becomes a real asset again. The research paper &quot;Web Page Classification Using WordNet's Linguistic Information&quot; explores the use of semantic networks, particularly WordNet and GreekWordNet, to enhance web page classification. The paper demonstrates how linguistic data, combined with word sense disambiguation (WSD) and semantic similarity measures, can effectively categorize web pages into predefined thematic areas.</p>\n<p>Even though today's search engines apply disambiguation to complete sentences and phrases instead of single words, the technique is still useful to learn to better understand how algorithms like BERT are used</p>\n<hr>\n<h2 id=\"semantic-networks-and-word-sense-disambiguation\" tabindex=\"-1\">Semantic Networks and Word Sense Disambiguation <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>Semantic networks like WordNet represent concepts (nodes) and the relationships between them (edges). WordNet groups words into sets of cognitive synonyms called <em>synsets</em>, which express distinct concepts.</p>\n<p>WordNet is a specific type of semantic network that groups words with similar meanings into sets called synsets. Each synset represents a specific meaning or idea. For example, in WordNet, the word &quot;bank&quot; might be part of one synset that refers to a place for money and another synset that refers to the side of a river. This technique allows applications to &quot;understand&quot; and select which meaning of a word you’re referring to.</p>\n<p>A problem in sorting text into categories (text classification) is figuring out the right meaning of a word when it has multiple meanings. This is called word sense disambiguation (WSD). It means deciding which meaning of a word fits best based on the words around it.</p>\n<p>In this paper, the authors use a special method called the UMND1 algorithm to solve this. It works by looking at the meanings of the nearby words and finding the one that makes the most sense. It does this by using WordNet’s synsets (groups of words with similar meanings) to calculate how similar the words are in meaning.</p>\n<p>Here's a simple Python example of how WSD might be implemented using the NLTK library's WordNet interface:</p>\n<pre><code>from nltk.corpus import wordnet as wn\nfrom nltk.wsd import lesk\n\n# Sample sentence and ambiguous word\nsentence = &quot;The bank will not approve the loan.&quot;\nambiguous_word = &quot;bank&quot;\n\n# Word sense disambiguation using lesk algorithm\nsense = lesk(sentence.split(), ambiguous_word)\nprint(f&quot;Word: {ambiguous_word}&quot;)\nprint(f&quot;Disambiguated Sense: {sense}&quot;)\nprint(f&quot;Definition: {sense.definition()}&quot;)\n</code></pre>\n<p>This function selects the correct meaning of &quot;bank&quot; based on the sentence. However, the paper uses a more sophisticated approach based on semantic similarity.</p>\n<hr>\n<h2 id=\"semantic-similarity-measures\" tabindex=\"-1\">Semantic Similarity Measures <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>The authors use two categories of semantic similarity measures: <strong>edge counting measures</strong> and <strong>information content measures</strong>. These measures calculate the closeness of concepts within WordNet's hierarchy. Below are some of the key measures:</p>\n<ol>\n<li><strong>Wu and Palmer (wup)</strong>: Measures similarity based on the depth of the concepts in the taxonomy.</li>\n<li><strong>Leacock and Chodorow (lch)</strong>: Computes the shortest path between two concepts and normalizes it by the maximum depth.</li>\n<li><strong>Resnik</strong>: Measures the shared information between two concepts.</li>\n</ol>\n<p>Here's an example of calculating the Wu and Palmer similarity between two words in Python:</p>\n<pre><code>from nltk.corpus import wordnet as wn\n\n# Words to compare\nword1 = wn.synset('car.n.01')\nword2 = wn.synset('automobile.n.01')\n\n# Calculate Wu-Palmer similarity\nsimilarity = word1.wup_similarity(word2)\nprint(f&quot;Wu-Palmer Similarity between {word1.name()} and {word2.name()}: {similarity}&quot;)\n</code></pre>\n<p>In the study, <strong>co-occurring synsets</strong> provided better classification results, especially when combined with these semantic measures. For example, using the <strong>Jiang and Conrath</strong> similarity measure improved disambiguation accuracy in the experiments.</p>\n<hr>\n<h2 id=\"web-page-classification-algorithm\" tabindex=\"-1\">Web Page Classification Algorithm <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>The classification algorithm developed in the paper focuses on analyzing anchor text (the clickable text of a hyperlink), as it often provides a concise summary of the linked page's content. The steps involved are:</p>\n<ol>\n<li><strong>Extract anchor text</strong> from the web page.</li>\n<li><strong>Disambiguate terms</strong> using WSD to find the most accurate sense for each word.</li>\n<li><strong>Calculate feature weights</strong> using a variant of the TF-IDF (Term Frequency-Inverse Document Frequency) algorithm to determine the importance of terms.</li>\n<li><strong>Categorize the page</strong> based on the predefined thematic areas using the processed features.</li>\n</ol>\n<p>The TF-IDF variant used here calculates how representative a term is for a particular category, which is crucial for distinguishing content. A Python implementation for basic TF-IDF might look like this:</p>\n<pre><code>from sklearn.feature_extraction.text import TfidfVectorizer\n\n# Example web page anchor texts\ndocuments = [\n&quot;The car is fast and reliable.&quot;,\n&quot;Automobile manufacturing is a key industry.&quot;,\n&quot;Banks offer loans for buying cars.&quot;\n]\n\n# Initialize TF-IDF Vectorizer\nvectorizer = TfidfVectorizer()\ntfidf_matrix = vectorizer.fit_transform(documents)\n\n# Display TF-IDF scores\nfeature_names = vectorizer.get_feature_names_out()\nfor doc_id, doc in enumerate(documents):\n\tprint(f&quot;\\nDocument {doc_id+1}:&quot;)\n\nfor word_id in tfidf_matrix[doc_id].nonzero()[1]:\n\tprint(f&quot;{feature_names[word_id]}: {tfidf_matrix[doc_id, word_id]:.4f}&quot;)\n</code></pre>\n<p>This example shows how TF-IDF helps in feature extraction for classification, giving higher weights to words like &quot;car&quot; and &quot;automobile&quot; in automotive-related documents.</p>\n<hr>\n<h2 id=\"experimental-results\" tabindex=\"-1\">Experimental Results <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>The paper compares various classification approaches and semantic similarity measures. For English web pages, the best results were obtained using <strong>co-occurring WordNet synsets</strong>, especially when paired with the Leacock-Chodorow and Wu-Palmer measures. The classifier could assign a web page to one of 245 categories with significant accuracy.</p>\n<p>Key findings include:</p>\n<ul>\n<li><strong>Co-occurring synsets</strong> yielded the best classification results.</li>\n<li>Using <strong>disambiguated terms</strong> improved the precision of thematic classification.</li>\n<li>The performance was enhanced by combining different similarity measures and using WordNet's semantic hierarchy.</li>\n</ul>\n<hr>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/webpage-classification/\">#</a></h2>\n<p>Even though most of these technique as described are no longer used, understanding how this applies to search engine and SEO is still valuable. It explains why, for example, anchor text is such an important aspect of building internal linking.</p>\n<p>Using generic text, such as &quot;read more&quot; for links would effectively disallow any application to disambiguate the words of the linked page.</p>\n<hr>\n<p><strong>References</strong></p>\n<p>[1] Kozanidis, E., Simaki, V., Koumpouri, A. <em>Web Page Classification Using WordNet's Linguistic Information</em>.\n[2] Fellbaum, Ch. (1998). <em>WordNet: An Electronic Lexical Database</em>. MIT Press.\n[3] Qi, X., &amp; Davison, B. (2009). <em>Web Page Classification: Features and Algorithms</em>. ACM Computing Surveys.</p>\n",
			"date_published": "2024-09-20T00:00:00Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/release-v2/",
			"url": "https://www.sitefig.net/blog/release-v2/",
			"title": "Release v2: Accessibility and Privacy upgrades",
			"content_html": "<p>I have been quiet for some time, but not anymore. Sitefig deployed a significant release last week. So, amidst the hush, I've been working hard to bring you an update that aligns with the feature requests gained from our customers.</p>\n<p>While the deployments have been continuous and discreet, this new release bumps the version up to v2.0 as many new items have been updated and added.</p>\n<h1 id=\"what-new-features-are-available-and-why\" tabindex=\"-1\">What new features are available and why? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v2/\">#</a></h1>\n<p>The accessibility community posted several example websites with use cases in which automated auditing software fails. Claiming that most of the accessibility fails cannot be solved with automated software.</p>\n<p>The goal is to solve as many &quot;impossible&quot; use cases as possible.</p>\n<p>The first part we solved was WCAG2.1 Success criteria 3.1.1 and, more specifically, 3.1.2.</p>\n<p>The two success criteria intend to ensure user agents, such as Jaws and NVDA, pronounce the words in the correct language. In many cases, the language needs to be corrected, or the language attribute is omitted.</p>\n<p>When the language is not set or is just wrong, the results for most screen reader users would be similar to driving around  Paris with an English GPS.\nNothing will be understandable.</p>\n<p>Sitefig analyses all content, including the language of title, description, alt and title attributes, to ensure all text is properly annotated with the correct language tag.</p>\n<h2 id=\"html5-and-screenreaders\" tabindex=\"-1\">HTML5 and Screenreaders <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v2/\">#</a></h2>\n<p>Screenreaders and browsers only sometimes play nice.\nSome HTML5 elements will be discarded even though using them makes sense. Sitefig now audits your websites for non-supported HTML5 elements.</p>\n<h1 id=\"privacy-upgrades\" tabindex=\"-1\">Privacy upgrades <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v2/\">#</a></h1>\n<p>Sitefig also records network traffic to identify potential privacy issues on your website. Most websites nowadays connect to many different domain names to load fonts, javascript, or images. These domains provide their services from different countries and continents.</p>\n<p>Sitefig geolocates the IP addresses and offers additional Whois data for each domain that sets a cookie for every tracker and domain name to which your customers connect. You'll be surprised how geographically spread your website connections are.</p>\n<p>Additionally, Sitefig records cookies before and after consent and categorizes each 3rd party cookie by function, goal, and company behind those cookies.</p>\n<p>Sitefig also has PII scanners that scan for names, physical addresses, email and telephone numbers, VAT, credit card numbers, and other types of sensitive data. We have upgraded the physical address scanner and now support scanning in 11 languages and many more countries.</p>\n<h1 id=\"supported-eu-languages\" tabindex=\"-1\">Supported EU Languages <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v2/\">#</a></h1>\n<p>Sitefig supports the following languages when auditing for accessibility issues related to languages, as well as scanning for PII:</p>\n<ul>\n<li>Hungarian</li>\n<li>Polish</li>\n<li>Danish</li>\n<li>Swedish</li>\n<li>French</li>\n<li>English</li>\n<li>Dutch</li>\n<li>German</li>\n<li>Portuguese</li>\n<li>Spanish</li>\n<li>Italian</li>\n</ul>\n<h1 id=\"new-documentation\" tabindex=\"-1\">New documentation <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v2/\">#</a></h1>\n<p>The documentation needed some love, and now it has been redesigned to align more with WCAG requirements and has a more straightforward and sleeker look.</p>\n<p>Version 2.0 is a significant upgrade, and we will follow up with more detailed posts about the new features.\nI hope you enjoy it!</p>\n",
			"date_published": "2023-12-11T10:53:35Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/european-acessibility-act/",
			"url": "https://www.sitefig.net/blog/european-acessibility-act/",
			"title": "European Accessibility Act and the private sector",
			"content_html": "<p>Accessibility is an important issue for people with disabilities, as it ensures that everyone has equal access to online information and services.</p>\n<p>The <strong>European Accessibility Act</strong>, which the European Union adopted in 2019, aims to make products and services more accessible for people with disabilities. Because the EAA <strong>applies to the private sector</strong>, accessibility is a direct and urgent issue for commercial enterprises.</p>\n<p>The EAA includes websites, an essential part of everyday life for many people.</p>\n<p>In this blog post, we will take a closer look at the European Accessibility Act and its <strong>impact on websites</strong>, including what it means for website owners and designers and how it will help make the internet a more inclusive place for everyone.</p>\n<p>The Act applies to many products and services, including digital products and services like websites, software, and mobile apps. The EAA aims to ensure that people with disabilities have the same opportunities to participate in society as everyone else.</p>\n<p>People with disabilities often face barriers to accessing essential services via websites or mobile apps. By making online banking, healthcare and transport services more accessible, people with disabilities are more likely to have access to the same services as everyone else.</p>\n<p>In addition, the EAA will also have an impact on businesses and organizations by promoting accessibility as a fundamental design principle. Inclusive design principles automatically result in more inclusive products and accessible services. The curb effects will benefit people with disabilities and older people with temporary disabilities and varying abilities.</p>\n<h2 id=\"what-are-the-general-eu-web-accessibility-laws\" tabindex=\"-1\">What are the general EU web accessibility laws? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>The EU has several laws and regulations in place to ensure web accessibility for individuals with disabilities. The most notable is the <strong><a href=\"https://eur-lex.europa.eu/eli/dir/2016/2102/oj\">Web Accessibility Directive (WAD)</a></strong>, which was adopted in 2016 and requires all public sector websites and mobile apps in the EU to be fully accessible by 23 September 2020. This directive is binding, and all EU member states must transpose it into their national laws.</p>\n<p>The <strong><a href=\"https://eur-lex.europa.eu/EN/legal-content/summary/accessibility-of-public-sector-websites-and-mobile-apps.html\">Regulation on the accessibility of the websites and mobile applications of public sector bodies</a></strong> requires all public sector websites and mobile apps in the EU to be fully accessible by 23 September 2020.</p>\n<p>All new public sector websites and apps must be designed to be fully accessible from the date of launch, and all existing public sector websites and apps must be made fully accessible by the deadline.</p>\n<p>The Regulation also requires that public sector bodies carry out regular accessibility testing and provide an accessibility statement on their website. The Regulation also requires that public sector bodies consider accessibility when procuring ICT products and services.</p>\n<p>Companies who do regular business with governments should take note of these requirements as they will likely impact your chances of winning public procurement.</p>\n<p>The <strong>European Accessibility Act (EAA)</strong> adopted in 2020 aims to ensure that certain vital products and services are accessible to people with disabilities. In addition, the Act includes provisions that enable people with disabilities to fully participate in implementing the Strategy for the Rights of Persons with Disabilities 2021-2030.</p>\n<p>The Act ensures that everyone has access to a range of everyday products and services, including:</p>\n<ul>\n<li>Phone services</li>\n<li>Banking services</li>\n<li>E-commerce</li>\n<li>Websites, mobile services, electronic tickets and all sources of information for air, bus, rail and waterborne transport services</li>\n<li>E-books</li>\n<li>Access to Audio-visual media services (AVMS.)</li>\n<li>Calls to the European emergency number 112</li>\n</ul>\n<p>The Act includes private companies and anyone providing the above services.</p>\n<h2 id=\"which-companies-have-to-comply\" tabindex=\"-1\">Which companies have to comply? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>EAA applies to all companies providing products or services to the EU, regardless of location.</p>\n<p>Unlike the other laws, the EAA applies to private companies selling products and services used by disabled people, with widely varying accessibility requirements across EU member states.</p>\n<h2 id=\"are-there-any-exemptions\" tabindex=\"-1\">Are there any exemptions? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Small companies that employ at most ten persons or have an annual turnover below EUR 2 million are exempt. An additional exception defines that if you can demonstrate &quot;undue burden&quot;, you do not need to comply.</p>\n<p>Additionally, there are limitations to what a company must make accessible.</p>\n<p>The Act defines the following content exemptions:</p>\n<ul>\n<li>Re-recorded time-based media published before 28 June 2025;</li>\n<li>office file formats published before 28 June 2025;</li>\n<li>online maps and mapping services if essential information is provided in an accessible digital manner for maps intended for navigational use;</li>\n<li>third-party content that is neither funded, developed by, or under the control of the economic operator concerned;</li>\n<li>content of websites and mobile applications qualifying as archives, meaning they only contain</li>\n<li>content that needs to be updated or edited after 28 June 2025.</li>\n</ul>\n<h2 id=\"how-will-the-eaa-be-enforced\" tabindex=\"-1\">How will the EAA be enforced? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>The Act is enforced by each EU member state, which means they decide the penalties and appoint the enforcement body.</p>\n<h2 id=\"consumers-reporting-non-compliance\" tabindex=\"-1\">Consumers reporting non-compliance <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Consumers in each member state must be able to report non-compliance to courts or the authority responsible for enforcing the law. In addition, both private and public organizations must be able to go to court or file a complaint.</p>\n<h2 id=\"penalties\" tabindex=\"-1\">Penalties <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Member states enforce their own penalties for non-compliance, which should be &quot;effective, proportionate, and dissuasive.&quot;</p>\n<h2 id=\"what-is-the-eaa-timeline\" tabindex=\"-1\">What is the EAA timeline? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Ultimately your website needs to be compliant by July 2025.</p>\n<h2 id=\"which-standard-has-to-be-used-to-make-your-website-compliant-with-the-eaa\" tabindex=\"-1\">Which standard has to be used to make your website compliant with the EAA? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>European Standard EN 301 549 is the document that defines the required accessibility standards. This standard adopts W3C's Web Content Accessibility Guidelines (WCAG.), which support many laws and standards around the world.</p>\n<p>The document directly references WCAG 2.1 AA and follows the same structure for Web (Chapter 9), Non-web documents (Chapter 10) and non-web software like mobile apps (Chapter 11).</p>\n<p>The standard EN 301 549 also follows the same underlying WCAG principles: Perceivable, Operable, Understandable, and Robust (POUR).</p>\n<p>There are, however, some differences between EN 301 549 and WCAG. Notably the requirement to make biological data such as facial recognition and fingerprints available to people with disabilities.</p>\n<p>Additionally, there are some additional requirements for France (RGAA) and Germany 5BITV)</p>\n<h2 id=\"how-do-you-make-sure-your-website-is-compliant-and-accessible\" tabindex=\"-1\">How do you make sure your website is compliant and accessible? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Making your website compliant is always the first step before you can benefit from making your website fully inclusive for all people.</p>\n<ol>\n<li>Determine whether you have to make your website accessible or whether your company or digital services are exempt.</li>\n<li>Second, use an automated tool to fix all the baseline issues that make your website inaccessible. 75% of the problems will be resolved, and your consultant will go through this step anyway.</li>\n<li>Hire a consultant/trainer to help your web team (marketing, content, and IT) take the last step to full compliance</li>\n<li>Audit and monitor ongoing changes to make sure your web team continues to produce accessible websites.</li>\n</ol>\n<h2 id=\"how-sitefig-can-help\" tabindex=\"-1\">How Sitefig can help <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/european-acessibility-act/\">#</a></h2>\n<p>Sitefig provides weekly accessibility reports and enables your web team to understand the issues and build a project plan to go from inaccessible to fully compliant websites.</p>\n<p>Enterprise customer also benefits from our extensive partner network. If you need additional training or consultants to start, we can provide the necessary contacts to make the next step.</p>\n",
			"date_published": "2023-03-03T08:36:35Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/automated-accessibility-testing-guide/",
			"url": "https://www.sitefig.net/blog/automated-accessibility-testing-guide/",
			"title": "Challenges of Automated Accessibility Testing for Business Owners",
			"content_html": "<p>Accessibility is an essential aspect of web design and development. It ensures that everyone, regardless of customers' physical or cognitive abilities, can use and interact with a website or application.</p>\n<p>Unfortunately, many <strong>websites still fail to meet basic accessibility standards</strong>, making it difficult or impossible for people with disabilities to access information or services.</p>\n<p>Accessibility is not only a moral and ethical imperative but also a <strong>legal requirement in many countries, including the United States</strong>.</p>\n<p>Failure to comply with accessibility standards can result in lawsuits and loss of business. In addition, accessibility testing ensures that all users can access and benefit from digital content, regardless of their abilities.</p>\n<p>In this blog post, we'll explore **what automated accessibility testing is, its benefits, and some of the challenges associated with this testing technique. **</p>\n<p>We'll also discuss some best practices for implementing automated accessibility testing and ensuring your website meets the latest accessibility guidelines.</p>\n<h2 id=\"explanation-of-automated-accessibility-testing\" tabindex=\"-1\">Explanation of automated accessibility testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing is a technique used to <strong>determine the accessibility level</strong> of a website or application automatically.</p>\n<p>In simpler terms, it involves using specialised <strong>software to scan web pages and identify accessibility issues</strong>.</p>\n<p>The software used for automated accessibility testing can simulate the actions of a person with disabilities and identify issues that might hinder or make it impossible for such individuals to use the website or application effectively.</p>\n<p>Automated accessibility testing is an efficient and reliable way to identify and fix accessibility issues on your website or application. By using automated tools, developers can ensure that their websites are accessible to users with disabilities, including those with visual, hearing, and mobility impairments.</p>\n<p>Additionally, automated accessibility testing can help you identify issues you might otherwise miss, ensuring that your website or application is inclusive and accessible to all users.</p>\n<p>The benefits of automated accessibility testing are numerous.</p>\n<p>For one, it saves time and resources. Instead of manually testing every aspect of your website or application, you can use automated tools to identify accessibility issues quickly and efficiently. This can save you time and reduce the costs associated with manual accessibility testing.</p>\n<p>Automated accessibility testing is more consistent and accurate than manual testing, ensuring all issues are identified and fixed.</p>\n<p>Finally, automated accessibility testing can help you meet legal requirements for accessibility, ensuring that your website or application complies with accessibility guidelines and regulations.</p>\n<h2 id=\"importance-of-automated-accessibility-testing\" tabindex=\"-1\">Importance of automated accessibility testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Ensuring accessibility is an important aspect of web development and design, even though it is not legally binding in the European Union.</p>\n<p>However, this does not diminish the significance of accessibility for European businesses. Failing to provide accessible websites and applications can lead to the exclusion of individuals with disabilities and hinder their ability to access information and services, potentially leading to reputational damage for your brand.</p>\n<p>Automated accessibility testing can help European businesses identify and fix accessibility issues on their websites and applications, ensuring they are inclusive and accessible to all users. By catering to the needs of individuals with disabilities, businesses can increase customer satisfaction, loyalty, and, ultimately, their revenue. In addition, it demonstrates a commitment to inclusivity and social responsibility, which can enhance the business's reputation.</p>\n<p>Moreover, providing accessible websites and applications can also give businesses a competitive advantage. With the growing awareness and demand for inclusivity and accessibility, companies prioritising these values will likely be more attractive to a broader range of customers.</p>\n<p>Therefore, even though accessibility is only legally binding for some sectors in the EU, it remains an important consideration for businesses that aim to create inclusive and accessible websites and applications that cater to the needs of all users. Automated accessibility testing can help European companies to achieve this goal and improve customer satisfaction, loyalty, and overall reputation.</p>\n<h2 id=\"benefits-of-automated-accessibility-testing\" tabindex=\"-1\">Benefits of automated accessibility testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing offers numerous benefits for European businesses. By utilising specialised software to scan web pages and identify accessibility issues, companies can save time and resources while ensuring that their websites and applications are accessible to users with disabilities.</p>\n<p>One significant benefit of automated accessibility testing is its ability to improve customer satisfaction and loyalty. By creating inclusive and accessible websites and applications, businesses can cater to the needs of all users, including those with disabilities. This can help build brand trust and loyalty, increasing sales and repeat business.</p>\n<p>In addition, automated accessibility testing can help businesses avoid legal issues. Although accessibility is not legally binding in the EU, it is still recommended and expected to become legally binding soon. By implementing automated accessibility testing, businesses can get ahead of the curve and avoid potential legal issues.</p>\n<p>Furthermore, automated accessibility testing can help businesses expand their customer base. People with disabilities make up a significant portion of the population. By ensuring that their websites and applications are accessible to this group, businesses can reach a wider audience, potentially leading to increased revenue and growth.</p>\n<p>Finally, automated accessibility testing can help businesses demonstrate their commitment to inclusivity and social responsibility. By prioritising accessibility, companies can show that they are committed to creating a more inclusive and equitable society, which can enhance their reputation and attract new customers who value these values.</p>\n<p>In summary, automated accessibility testing offers a range of benefits for European businesses, including improved customer satisfaction and loyalty, legal compliance, an expanded customer base, and a demonstration of their commitment to inclusivity and social responsibility.</p>\n<h2 id=\"what-is-automated-accessibility-testing\" tabindex=\"-1\">What is Automated Accessibility Testing? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>This section will delve into what automated accessibility testing is and how it works. We will explore the different types of automated accessibility testing and discuss their advantages and limitations. By understanding what automated accessibility testing is and how it works, you can make informed decisions about implementing it in your business and ensuring that your websites and applications are inclusive and accessible to all users.</p>\n<h2 id=\"explanation-of-automated-accessibility-testing-1\" tabindex=\"-1\">Explanation of automated accessibility testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing involves using specialised software to scan web pages and identify accessibility issues. These tools use a combination of algorithms and heuristics to analyse web pages and identify potential problems that may impact users with disabilities. However, there are technical challenges involved in building these tools, as web development technologies are constantly evolving, and new accessibility issues may arise as a result.</p>\n<p>Furthermore, there is a lack of knowledge among developers when it comes to automated accessibility testing. Many developers are unfamiliar with the technical aspects of accessibility testing or do not have the time or resources to manually test their websites and applications for accessibility. This can lead to accessibility issues going unnoticed and result in the exclusion of individuals with disabilities.</p>\n<p>Automated accessibility testing helps to address these challenges by providing developers with a way to automate the testing process and identify potential accessibility issues automatically. This can save time and resources while ensuring that websites and applications are accessible to users with disabilities.</p>\n<p>However, it's essential to note that automated accessibility testing is imperfect and has limitations. While these tools can identify many accessibility issues, there are some issues that only human testing can detect. Automated testing should, therefore, be used as a supplement to manual testing rather than a replacement.</p>\n<p>In summary, automated accessibility testing is a valuable tool for identifying potential accessibility issues automatically. However, there are technical challenges involved in building these tools, and there is a lack of developer knowledge regarding automated accessibility testing. Therefore, it's essential to recognise the limitations of automated testing and supplement it with manual testing to ensure that websites and applications are inclusive and accessible to all users.</p>\n<h2 id=\"types-of-automated-accessibility-testing\" tabindex=\"-1\">Types of automated accessibility testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>There are several types of automated accessibility testing that businesses can use to ensure that their websites and applications are accessible to users with disabilities. Some examples include: Static Analysis: This type of testing involves analysing the code and content of web pages to identify accessibility issues. Static analysis tools can identify problems like missing alt text for images, incorrect heading structure, and missing form labels.</p>\n<p>Dynamic Analysis: This type of testing involves analysing the behaviour of web pages to identify accessibility issues. Dynamic analysis tools can identify issues like keyboard accessibility, focus management, and colour contrast.</p>\n<p>Hybrid Analysis: This type of testing combines static and dynamic analysis to provide a more comprehensive assessment of web page accessibility. Hybrid analysis tools can identify a wide range of accessibility issues, including those that are difficult to locate using either static or dynamic analysis alone.</p>\n<p>Visual Regression Testing: This type of testing involves comparing screenshots of web pages over time to identify changes that may impact accessibility. Visual regression testing tools can help businesses to ensure that changes to their websites and applications do not negatively impact accessibility.</p>\n<p>By using a combination of these automated accessibility testing tools, businesses can ensure that their websites and applications are accessible to users with disabilities. It's important to note that no single agency or approach can provide a complete assessment of accessibility, and manual testing is also necessary to supplement automated testing.</p>\n<h2 id=\"benefits-of-automated-accessibility-testing-1\" tabindex=\"-1\">Benefits of Automated Accessibility Testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing can benefit businesses and organisations of all sizes. By identifying potential accessibility issues automatically, these tools can help businesses to save time and resources while ensuring that their websites and applications are accessible to users with disabilities.</p>\n<p>In this section, we will explore the benefits of automated accessibility testing in more detail, including how it can improve user experience, reduce legal risks, and enhance brand reputation. We will also discuss how automated accessibility testing can help businesses to meet accessibility standards and guidelines and provide a more inclusive experience for all users.</p>\n<h2 id=\"time-saving\" tabindex=\"-1\">Time-saving <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>One of the most significant benefits of automated accessibility testing is that it can save businesses time and resources. In traditional accessibility testing methods, developers or testers would need to manually test each web page for accessibility, which can be time-consuming and expensive. With automated accessibility testing, the testing process can be automated and streamlined, allowing businesses to identify potential accessibility issues quickly and efficiently.</p>\n<p>Automated accessibility testing tools can scan web pages and identify accessibility issues in a matter of seconds or minutes, depending on the size of the website or application. This allows developers to identify and fix potential accessibility issues early in the development process rather than waiting until the end of the project, when issues can be more costly and time-consuming to fix.</p>\n<p>In addition, automated accessibility testing can help businesses to save money by reducing the need for manual testing or expensive accessibility consultants. Using automated testing tools, companies can ensure their websites and applications are accessible without relying on external consultants or dedicating internal resources to manual testing.</p>\n<p>Overall, the time-saving benefits of automated accessibility testing can help businesses to reduce costs, improve development timelines, and ensure that their websites and applications are accessible to users with disabilities. By using automated testing tools, companies can focus on creating a more inclusive experience for all users while saving time and resources.</p>\n<h2 id=\"cost-effective\" tabindex=\"-1\">Cost-effective <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing can also bring significant cost-saving benefits to businesses. In addition to saving time on testing and development, automated accessibility testing tools can help companies to reduce costs associated with manual testing, accessibility audits, and potential legal fees.</p>\n<p>For example, manual accessibility testing can be expensive, particularly for large websites or applications. Hiring accessibility consultants or testers to manually test each web page can cost thousands of dollars and take weeks or even months. Automated accessibility testing, on the other hand, can scan the entire website in hours or days at a much lower cost.</p>\n<p>In recent years, there has been a significant increase in the number of accessibility lawsuits filed against businesses, particularly in industries like finance, healthcare, and education. By ensuring that their websites and applications are accessible from the outset, companies can reduce the risk of being sued for accessibility violations. In addition, automated accessibility testing can help businesses to avoid costly legal fees associated with accessibility lawsuits.</p>\n<p>Furthermore, automated accessibility testing can also help businesses to reduce costs associated with fixing accessibility issues after launch. Fixing accessibility issues after launch can be much more expensive than addressing them early in development. With automated accessibility testing, businesses can identify and resolve potential accessibility issues early on before they become more costly.</p>\n<p>Overall, the cost-saving benefits of automated accessibility testing can help businesses to reduce expenses associated with manual testing, accessibility audits, and legal fees while also improving the accessibility of their websites and applications. By investing in automated accessibility testing tools, businesses can save money while ensuring their digital properties are accessible to users with disabilities.</p>\n<h2 id=\"better-coverage\" tabindex=\"-1\">Better coverage <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Another benefit of automated accessibility testing is that it can provide better coverage of accessibility issues than manual testing. Automated testing tools can scan every website or application page for accessibility issues, whereas manual testing may only cover a limited number of pages or components.</p>\n<p>Automated testing tools can also help to identify accessibility issues that may be difficult or impossible to detect manually, such as issues related to colour contrast, keyboard accessibility, and ARIA attributes. These tools can also see problems that may be difficult to reproduce consistently, such as issues related to screen-reader compatibility or assistive technology.</p>\n<p>For example, an automated accessibility testing tool could identify a low-contrast button on a web page that may be difficult for users with visual impairments to see. In contrast, a manual tester may not have noticed this issue, mainly if they were not explicitly looking for it. In addition, automated testing tools can provide more consistent and repeatable results than manual testing, as they use a standardised set of rules and guidelines to test for accessibility. This can help to ensure that accessibility issues are identified and addressed consistently across all pages and components of a website or application.</p>\n<p>Overall, the better coverage aspect of automated accessibility testing can help businesses to identify a broader range of accessibility issues, including those that may be difficult or impossible to detect manually. By using automated testing tools, companies can ensure that their websites and applications are accessible to users with disabilities, providing a more inclusive experience for all users.</p>\n<h2 id=\"consistency-and-accuracy\" tabindex=\"-1\">Consistency and accuracy <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Automated accessibility testing also offers the benefits of consistency and accuracy. When using manual testing methods, accessibility issues can be missed due to human error, bias, or simply because a tester may not know all the accessibility requirements. Automated testing tools, on the other hand, use a standardised set of rules and guidelines to test for accessibility, which helps to ensure that accessibility issues are identified and addressed consistently across all pages and components of a website or application.</p>\n<p>Automated testing tools can also provide more accurate results than manual testing, as they are less prone to human error or oversight. These tools can scan large volumes of code and detect accessibility issues quickly and accurately, reducing the risk of missing important points. In addition, automated testing tools can provide detailed reports that include specific problems, recommendations for remediation, and even code snippets to help developers fix the issues. For example, an automated accessibility testing tool could identify a missing alt tag on an image, which is essential for users with visual impairments who rely on screen readers. In contrast, a manual tester may have overlooked this issue or missed it due to a mistake or oversight.</p>\n<p>Overall, the consistency and accuracy of automated accessibility testing can help businesses to ensure that their websites and applications are fully accessible to users with disabilities. By using automated testing tools, companies can identify and address accessibility issues quickly and accurately, improving the user experience for all users.</p>\n<h2 id=\"challenges-of-automated-accessibility-testing\" tabindex=\"-1\">Challenges of Automated Accessibility Testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>While there are many benefits to automated accessibility testing, there are also some challenges that businesses may face when implementing these tools. In the next chapter, we will explore some of the key challenges of automated accessibility testing and discuss strategies for addressing these challenges to ensure that businesses can fully realise the benefits of these tools.</p>\n<h2 id=\"false-positives\" tabindex=\"-1\">False positives <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>False positives occur when a computerised testing tool incorrectly identifies an element as inaccessible, even though it complies with accessibility guidelines. This can lead to wasted time and resources, as developers may spend time fixing issues that do not exist.</p>\n<p>While most accessibility scanners are considered reliable and effective automated testing tools, they have been known to flag elements as inaccessible even when they comply with accessibility guidelines. For example, many tools may flag a link as having insufficient contrast, even when the link's contrast ratio meets WCAG guidelines.</p>\n<p>To address the issue of false positives, businesses should take steps to verify the results of automated testing tools and should not rely solely on the output of these tools. This may involve manually reviewing elements that have been flagged as inaccessible to determine whether the issues are valid or not. In addition, businesses should work with their development teams to ensure that developers understand how to interpret the output of automated testing tools and can distinguish between valid accessibility issues and false positives.</p>\n<p>Overall, while false positives can be a challenge when using automated accessibility testing tools, businesses can take steps to address this issue and ensure that these tools effectively identify and address accessibility issues. By combining automatic and manual testing methods, companies can ensure that their websites and applications are fully accessible to all users, regardless of their abilities.</p>\n<h2 id=\"lack-of-human-judgement\" tabindex=\"-1\">Lack of human judgement <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>While automated testing tools are effective at identifying many types of accessibility issues, they cannot replicate the nuanced judgement and experience of a human tester. For example, an automated testing tool may flag a page as inaccessible because of a missing alt tag on an image but may not be able to determine whether the alt tag accurately describes the image's content in a meaningful way to users with disabilities.</p>\n<p>On the other hand, human testers can apply their judgement and experience to identify issues that may be more difficult to detect using automated testing tools. For example, a human tester may be able to identify problems related to the language used on a website or may be able to identify issues related to the overall flow and usability of a website.</p>\n<p>To address the challenge of the lack of human judgement in automated accessibility testing, businesses should consider combining automated and manual testing methods. While automated testing tools can help to identify many types of accessibility issues quickly and efficiently, manual testing can help to identify more nuanced issues that may be missed by automated means. In addition, businesses should ensure that their development teams are knowledgeable about accessibility best practices and can apply their own judgement and experience to identify and address accessibility issues. By working with both automated and manual testing tools, businesses can ensure that their websites and applications are fully accessible to users with disabilities.</p>\n<h2 id=\"technical-limitations\" tabindex=\"-1\">Technical limitations <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Another challenge of automated accessibility testing is the technical limitations of these tools. While automated testing tools are effective at identifying many types of accessibility issues, they may not be able to detect all kinds of problems. For example, automated testing tools may not be able to detect issues related to the content's context, such as the readability of text within a particular design or layout.</p>\n<p>In addition, automated testing tools may not be able to detect issues related to the dynamic nature of web content. For example, an automated testing tool may not be able to find changes to a website's content that occur in response to user interactions, such as pop-up windows or drop-down menus.</p>\n<p>To address the challenge of technical limitations in automated accessibility testing, businesses should work with their development teams to ensure that their websites and applications are designed and developed in a way that is accessible by default. This may involve using accessible design patterns, following best practices for semantic markup, and ensuring that all content is presented clearly and understandably.</p>\n<p>In addition, businesses should consider using automated and manual testing methods to ensure their websites and applications are fully accessible. This may involve using automated testing tools to identify and address common accessibility issues quickly and efficiently while also performing manual testing to identify more nuanced issues that may be missed by automated means.</p>\n<p>Overall, while automated accessibility testing tools can be effective at identifying many types of accessibility issues, businesses should be aware of the technical limitations of these tools and should take steps to address these limitations through a combination of automated and manual testing methods.</p>\n<h2 id=\"best-practices-for-automated-accessibility-testing\" tabindex=\"-1\">Best Practices for Automated Accessibility Testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>As we've seen, automated accessibility testing can be a valuable tool for businesses looking to ensure that their websites and applications are accessible to all users. However, to get the most out of these tools, it's essential to follow best practices for automated accessibility testing.</p>\n<p>In the following section, we'll explore some of the best practices businesses should consider when using automated testing tools to ensure their websites and applications are accessible to all users.</p>\n<h2 id=\"use-a-combination-of-manual-and-automated-testing\" tabindex=\"-1\">Use a combination of manual and automated testing <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>While automated accessibility testing can be a valuable tool, it's important to note that it's best used with manual testing. Manual testing involves using human judgement and expertise to evaluate a website or application's accessibility and can help to identify issues that may be missed by automated testing tools.</p>\n<p>When using a combination of manual and automated testing, it's crucial to prioritise the most critical areas of your website or application. This may include areas of your website that are frequently used, such as navigation menus or search bars, or particularly complex or dynamic areas.</p>\n<p>Establishing clear testing protocols and procedures is important to ensure testing is conducted consistently and effectively. This may involve defining specific accessibility standards to test against, establishing a set of testing criteria and procedures, and documenting testing results and any identified issues.</p>\n<p>In addition, involving a diverse group of testers in your testing process is essential. This may include users with disabilities or impairments and testers with different levels of experience or expertise. By involving a diverse group of testers, you can help to identify a broader range of accessibility issues and ensure that your website or application is accessible to the widest possible range of users.</p>\n<p>Overall, while automated accessibility testing can be a valuable tool, it's essential to use it with manual testing and establish clear testing protocols and procedures to ensure that testing is conducted consistently and effectively. By following these best practices, businesses can help to ensure that their websites and applications are fully accessible to all users.</p>\n<h2 id=\"stay-up-to-date-with-accessibility-guidelines\" tabindex=\"-1\">Stay up to date with accessibility guidelines <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>Another important consideration for automated accessibility testing is that accessibility guidelines are always evolving. As a result, companies must stay current on the latest procedures and standards to ensure that their websites and applications remain fully accessible.</p>\n<p>The Web Content Accessibility Guidelines (WCAG) are a case in point. The latest release, WCAG 2.1, includes several new success criteria that are not included in earlier releases. These new success criteria address various accessibility issues, including mobile accessibility, cognitive accessibility, and more.</p>\n<p>To ensure that their websites and applications remain fully accessible, businesses should try to stay up-to-date with the latest accessibility guidelines and standards. This may include regularly reviewing the latest guidelines and testing their Web sites and applications against them to identify areas for improvement.</p>\n<p>In addition, businesses should also consider working with accessibility experts or consultants who can help to ensure that their websites and applications meet the latest accessibility standards and guidelines. These experts can provide valuable insights and recommendations for improving accessibility and help ensure businesses comply with accessibility laws and regulations.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/automated-accessibility-testing-guide/\">#</a></h2>\n<p>To conclude, automated accessibility testing is critical for businesses looking to ensure that their websites and applications are fully accessible to all users. By automating the testing process, companies can save time and money and improve coverage, consistency and accuracy.</p>\n<p>However, it is crucial to know the challenges associated with automated accessibility testing, including false positives, poor human judgment, and technical limitations. Companies should consider using a combination of manual and automated testing and keeping abreast of current accessibility guidelines and standards.</p>\n<p>Ultimately, accessibility should be a priority for all businesses, ensuring equal access to digital assets and services. By prioritising accessibility and using automated accessibility testing tools, companies can create a more inclusive and accessible online environment while ensuring compliance with accessibility laws and regulations.</p>\n",
			"date_published": "2023-03-03T08:36:35Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/why-web-governance/",
			"url": "https://www.sitefig.net/blog/why-web-governance/",
			"title": "What is web governance and why you need it",
			"content_html": "<p>Web governance might seem like a relatively new term, but it has been around for quite some time now. As this is nothing tangible or calculative, most website owners or managers believe that it is either not being done or is simply not necessary. Both beliefs are wrong. For just about any website to succeed, individuals affiliated with it must understand what web governance is and why it is so crucial.</p>\n<p>It is not fun, and yet it might be the primary factor behind your website sinking or sailing. Web governance refers to the processes and policies put in place to aid in the management and maintenance of the website.</p>\n<p>By the time you are done reading this article, we believe you will have a firm grip on the many intricacies of web governance and the reasons behind its strong necessity.</p>\n<h2 id=\"what-is-web-governance\" tabindex=\"-1\">What Is Web Governance? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>To understand what web governance truly is, the first step is to know its many components. There is no particular set of methodologies that every website owner has to follow to govern their sites. Different people might feel the need to pursue different pathways.</p>\n<p>In general, web governance consists of processes, policies, and procedures. The key idea behind this is to establish a website regulatory process to set specific guidelines depending on the ideologies of the organization owning the website. If you already happen to own a business website and are constantly strategizing your digital marketing efforts, know that web governance is already in place.</p>\n<p>Yes, you might not be calling it that, but you already are involved in this. Some other names for web governance include digital governance or website management. Hence, you might as well start learning all about web governance so that you can streamline your business processes, even more, leading to increased productivity in the long run.</p>\n<h2 id=\"what-are-the-most-common-components-of-a-website\" tabindex=\"-1\">What Are the Most Common Components of a Website? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Every website is built on certain ideas, notions, constraints, and standards. The designer and the developer (at times both are represented by the same person known as a full-stack developer) take their time and make a comprehensive plan before going ahead and initiating the development. Make no mistake: a website not only requires a high quantity of quality content, but it also requires extensive work in the background, or away from the website altogether.</p>\n<p>The programmer takes care of the coding part and effectively builds the website from scratch. Ranging from the dynamic functionalities of the site to the various design and alignment aspects, the coder deals with them all and brings it down to a discernible structure. Yet this is not all. The code and the content are simply not enough.</p>\n<p>A multitude of legal compliances must also be considered before expecting anything worth writing home about from the article. These compliances may include the overall accessibility of the website, the GDPR or general data protection regulation factor, and more.</p>\n<h2 id=\"who-publishes-the-website-and-when-is-it-done\" tabindex=\"-1\">Who Publishes the Website and When Is It Done? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Once all the data to be uploaded is prepared and accumulated, the hard part is over. Now it is up to the developer to integrate the information and data into the website. This depends on either the preference of the client for whom the site is being made or for the owner’s personal or commercial use.</p>\n<p>A point to remember here is that no significant set of skills is required for a website to be published on the web. A dedicated developer is not necessary, although having one can certainly be productive.</p>\n<p>Companies decide on the publishing time based on their deadlines or needs. Owners can delay as long as they want but should never rush when dealing with unfinished content. Doing this can be lethal for the website as any number of people visiting it might leave a strongly negative review. You will witness a drastic decrease in the traffic, and if the incompletions are still kept unattended, the traffic might eventually become non-existent. Timing is key and is a crucial aspect of website governance.</p>\n<h2 id=\"how-is-a-website-and-its-content-published\" tabindex=\"-1\">How Is a Website and Its Content Published? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Let us begin with how a website and its contents are published onto the Internet. As mentioned above, there is no rule as to who will be carrying out the act itself but, in general, it is the developer who tends to load the website with the content. Every publisher requires three things to publish content on a website and eventually go on to upload the website itself onto the web: Internet connection, web development software, and a web server for hosting the site.</p>\n<p>Among these, the web development tool is arguably the most important as this is where the site is created in the first place. Dreamweaver is a great application for professional web designing. WordPress is a world-renowned content management system or CMS, where developers can drag and drop any component they want and integrate them into the website.</p>\n<p>An Internet connection is required to carry out these tasks and go on to upload the freshly built website to a web server. Large-scale websites can use a single server on their own, while relatively smaller sites can take their places among other similar sites in shared servers.</p>\n<p>There is no cost associated with publishing content on a website, apart from perhaps the cost of the Internet. No physical materials are needed so money is saved on, say, paper and ink. On top of that, any content published on the web has a significantly higher chance of attracting more traffic (read visitors) than doing the same in the form of a book or journal.</p>\n<p>Think of the hundreds of thousands of people maintaining their websites every day. This in itself is a classic example of web governance. Thus, every company is doing web governance. The question is not if, but how good you are at it.</p>\n<h2 id=\"why-do-we-need-web-governance\" tabindex=\"-1\">Why Do We Need Web Governance? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Now that we have a fair idea of what web governance is, let us take a look at why it is needed in the first place. One of the key reasons for web governance not getting the hype it deserves is down to the fact that most people have limited ideas on it. Even recurring implementers are often completely unaware of web governance despite using it every day. The following sections describe the primary motivations behind opting for web governance.</p>\n<h3 id=\"keeps-you-organized\" tabindex=\"-1\">Keeps You Organized <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>Make no mistake: Web governance is different from web management. The latter is the clear act of maintaining a website by sustaining its standards. However, the former is the implementation of a system following which the management is done.</p>\n<p>It is more like a rule book where the rules are the acts of management. Having a clear set of guidelines for all your website managers will reduce inconsistencies significantly.</p>\n<p>Remember, your website represents your brand. Any blemish on it will directly impact your business—something which can be avoided if a comprehensive plan is made and carried out. Anything ambiguous or misleading on your website will directly hamper the reputation and image of your brand, and of course, the site itself.</p>\n<p>Unless a definite and precise web governance system is in place, you will need to face a lot of meetings and time-wasting quarrels just to get things in order. This reduces efficiency considerably.</p>\n<p>Setting definitive standards, policies, and guidelines will enable the web development team to act without guessing. All independent web development aspects need to align at the very end. If not, know that something went wrong or was out of proportion during the development stage.</p>\n<p>Imagine a scenario where you have tasked your designer to create some lavish headers and footers for a page you will be publishing on your website. If the parameters and dimensions implemented by the designer do not match with the programmer who will be assembling all the content and uploading it, chances are, the entire work will fall apart. Having web governance methodologies integrated into the system, such mishaps hardly ever occur.</p>\n<h3 id=\"raises-the-efficiency\" tabindex=\"-1\">Raises the Efficiency <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>In simple terms, the more organized you get, the higher levels of efficiency you get to hit. Once you lay the foundations of web governance, it will help the website to evolve gradually over time. Think of a country or a province that has just achieved independence. The newly integrated laws take time to bring visible changes in the country, but will surely be discernible as time goes by. Web governance acts in the same way.</p>\n<p>Furthermore, the fact that a plan is implemented, the right people get to work in the right departments. A programmer would not necessarily have to resort to writing content under such circumstances. Individuals can play to their strengths—raising efficiency in the process.</p>\n<p>Every step being taken is done by the person best at it. There will always be someone at every end to deal with problems related to their departments. This high level of resource can only be done with efficiency if web governance is established on the website.</p>\n<p>Additionally, if all the departments and teams follow a specific plan, they can communicate with each other and develop the best version of their products. The sales and marketing teams can collaborate with the legal team and deal with any legal issues associated with the products, or the website itself.</p>\n<p>The IT professionals can get direct guidelines on how to design the products with the highest demand in the market. In short, all the teams can combine with ease and extract the best results as long as web governance is in place.</p>\n<h2 id=\"understand-what-you-have\" tabindex=\"-1\">Understand What You Have <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>To establish a set of rules and guidelines for anything, you would need a comprehensive idea of what it truly is. Web governance acts in the same way. To integrate its methodologies into your website, you need to learn everything there is to know about the site. The best way to do that is to go for an audit, followed by constant monitoring.</p>\n<p>Many website owners resort to website audits when things start to go wrong. A website can stop yielding expected results even after keeping everything constant, and there can be plenty of reasons behind it. To figure that out, a web audit is required.</p>\n<p>Professional auditors like Sitefig start the process by thoroughly examining and scrutinizing all the characteristics and functionalities of the site. This is done to identify the key elements (or the lack thereof) that are contributing to its diminished performance levels. Auditing not only locates the issues but also how they can be resolved and avoided in the future.</p>\n<p>Some of the most common (and crucial) pieces of information that owners can gather after the completion of audits include where the errors are occurring, where the updates are required to be implemented, which links need repairing, where invalid data is hiding, spelling errors, and a whole lot more. Expert auditors spend a considerable amount of time monitoring the website to dig out all the inconsistencies and make reports accordingly.</p>\n<p>These auditors also keep their eyes on compliance issues like GDPR, accessibility, and content. Unless GDPR is followed, not only does a website lose its claim to be considered a standard, but it also fails miserably in the battle of ranks against competitors. This causes a snowball effect and the website quickly loses its credibility among the visitors and sets on a path toward failure.</p>\n<p>Accessibility is hampered massively, and even though you might have the most lightweight site out there, no one will be visiting. As for the content within, the higher the quality, the more traffic is generated. Auditors check the quality of the content as well and make their judgments based on it.</p>\n<h2 id=\"build-standards-and-policies-using-web-governance\" tabindex=\"-1\">Build Standards and Policies Using Web Governance <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Not only does the positive outcome of web governance take time to be visible, but the act of implementation itself also requires a handsome amount of time. Experts need to figure out important aspects like what cookies they have, their usage, the content available, the ease of access, and much more.</p>\n<p>Fundamental policies need to be applied to each website regardless of their types and applications. An example would be allowing traffic from every corner of the world. After that, specific policies are required to take the site to the next level.</p>\n<p>For instance, a blogging site might have rules regarding underage content but a winery would have nothing like that. These policies should be extremely strict and should only be altered under dire circumstances.</p>\n<p>These should also be very clear, straightforward, and logical so that developers and end-users do not find them perplexing or baffling. An example of a potential policy would be to mandate the use of calls to action on every page of the website.</p>\n<p>On top of all that, standards are established to guarantee that the quality, voice, and style of your website are consistent. There are several working hands on your website, and they may all have individual methods or ideas for accomplishing things.</p>\n<p>This pushes designers and copywriters to work towards a single goal, or standard in this regard. When there are a lot of individuals involved with your website, it can be challenging to keep standards up. The mix of policies and standards contributes to the success of your website.</p>\n<h2 id=\"update-regularly-and-keep-track-of-changes\" tabindex=\"-1\">Update Regularly and Keep Track of Changes <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>As you are well aware by now, web governance is a continuous process. It is not something that you focus on once a year during restructuring or cleanup. Make no mistake: we are not suggesting you bring changes to your active policies and standards. It is the governance aspects that need to be updated regularly, and the changes kept track of.</p>\n<p>Let us take a real-life scenario as an example. Imagine a city going through troubled times due to increased crime rates. The local police get deployed. Does this mean the end of it? Certainly not. These individuals need to be monitored constantly and allocated based on the needs of specific locations. More soldiers might be required to dissolve the situation.</p>\n<p>Specialized units might need to be deployed in darker regions during the night. All these are issues that require active control. Web governance is exactly that. Once you deploy your policies and standards, you need to keep monitoring the situation and make informed decisions throughout.</p>\n<h2 id=\"web-governance-protects-your-assets\" tabindex=\"-1\">Web Governance Protects Your Assets <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>A website is an asset, but that is not all. The associated brand image, goodwill, reputation, client base, etc., are all assets of your company. That is because none of these can be ignored without killing the business off completely. Web governance ensures that none of these is ignored by any means. Let us take a brief look at some of the benefits of web governance in this regard.</p>\n<h3 id=\"brand-damage\" tabindex=\"-1\">Brand Damage <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>Web governance negates the damage caused to the brand due to inefficient practices by the website managers. Having a set of rules and guidelines will not only keep the operations streamlined, but will also ensure that the clients do not take a negative view of the company. Large engineering organizations are heavily affected whenever their brand image is damaged. That is because clients tend to steer clear of companies that are not represented well on open markets.</p>\n<p>Any service that you take from, say, an engineer needs to be precise and spot on. Potential customers can only know about this from their brand image, thus making it extremely crucial to sustain high standards in this aspect.</p>\n<h3 id=\"legal-implications\" tabindex=\"-1\">Legal Implications <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>The European Union (EU) is ramping up on existing GDPR cases, and rightfully so. Imagine an engineering organization that does not comply with GDPR guidelines. What are the chances of you going ahead and using their services? All you would know is the company does not keep your data safe, which is enough for the deal to fall through. Such is the importance of abiding by GDPR rules these days.</p>\n<h3 id=\"seo\" tabindex=\"-1\">SEO <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>The importance of SEO (search engine optimization) can never be overstated. For potential visitors and clients to access a website, it needs to be ranked high enough on the search engine results page (SERP). SEO ensures just that by improving anything and everything on the website and bringing them up to the standards of modern search engines.</p>\n<h3 id=\"accessibility-and-user-experience\" tabindex=\"-1\">Accessibility and User Experience <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>Recent guidelines in popular search engines show that it is not just the components but also the overall user experience that plays a significant part in the ranking of the website. A user will tend not to spend time or return to a website if the experience was not something to write home about. Web governance efforts must focus on these factors for the website to reach the desired levels of excellence.</p>\n<h3 id=\"reduced-cost-and-time-to-deliver\" tabindex=\"-1\">Reduced Cost and Time to Deliver <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h3>\n<p>Web governance is a system, not a particular task. If comprehensively followed, it not only reduces the overall costs but also contributes to faster deliveries. When each person working on the website follows a fixed set of guidelines, costs are reduced as no wrong decisions are made throughout. This, in turn, reduces the time of delivery as final outputs are obtained faster due to proper plans being followed.</p>\n<h2 id=\"overview\" tabindex=\"-1\">Overview <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-web-governance/\">#</a></h2>\n<p>Whether you are aware or not, web governance is essential for the success of a website. You may not think you are following any guidelines, but in reality, you are, as shown earlier in this article. All you need to do is enhance those actions and convert them to hard and fast rules that all the website managers can abide by.</p>\n<p>Seek the help of professionals like Sitefig and determine the steps that you can take to establish complete web governance in your personal or business website.</p>\n",
			"date_published": "2022-11-25T10:30:47Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/release-v1-2-0/",
			"url": "https://www.sitefig.net/blog/release-v1-2-0/",
			"title": "Release v1.2.0: Pdf and Exoscale",
			"content_html": "<h2 id=\"pdf-verification\" tabindex=\"-1\">PDF verification <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v1-2-0/\">#</a></h2>\n<p>Verifying PDF documents is rather tricky and cumbersome. That is why Sitefig Enterprise now includes PDF verification.</p>\n<p>No more searching and double-checking bulky PDf documents; you can rely on Sitefig to validate your PDF documents.</p>\n<p>Existing customers can access PDF audits previously not included in the crawls, and we will add more features in the future.</p>\n<p>The release contains the following audits:</p>\n<ul>\n<li>Missing language identifier (Matterhorn 1.02 11-001, WCAG success criteria 3.1.1 Language of Page)</li>\n<li>Omitted accessibility permissions</li>\n<li>Verification of tagged PDF documents (Matterhorn 1.02 01, 1WCAG Success criteria 1.3.1 Info and Relationships)</li>\n<li>Missing title (Matterhorn 1.02 06-003 and 06-004, WCAG Success cirteraia 2.4.2 level A)</li>\n<li>Multiple-page PDF documents must have bookmarks (WCAG Success criteria: 2.4.1 Bypass Blocks (Level A) 2.4.5 Multiple Ways (Level AA))</li>\n<li>Empty PDf document</li>\n<li>Corrupt Pdf documents</li>\n<li>Broken link check extended to PDF documents.</li>\n</ul>\n<h2 id=\"a-new-cloud-provider-exoscale\" tabindex=\"-1\">A new cloud provider: Exoscale <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v1-2-0/\">#</a></h2>\n<p>Sitefig recently switched to a new provider: Exoscale.</p>\n<p>The choice of the new provider was guided by two issues, cost and GDPR compliance. An added bonus was the fast and accurate customer service from Exoscale and the exceptionally user-friendly portal that allows us to manage the servers.</p>\n<p>Exoscale is fully compliant with GDPR rules and, most importantly, does not fall under the contested PrivacyShield or the Trans-Atlantic Data Privacy Framework.</p>\n<p>All data is stored in the Frankfurt data centre, and the company Exoscale is a registered company in Switzerland.</p>\n<p>The switch also allowed us to improve the crawling speed for multiple customers. All customer crawls now run in complete isolation, improving the performance metrics reporting and time to finish a website crawl and analysis.</p>\n<h2 id=\"what-is-next\" tabindex=\"-1\">What is next? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/release-v1-2-0/\">#</a></h2>\n<p>Due to the move to Exoscale, many features were waiting in the backlog. The next feature that is coming up is audit handling and ticketing support. &quot;Ignore&quot; audits and/or tagging audits for review Connecting audits with tickets Jira integration Creating tickets from Sitefig</p>\n<p>Anything you'd like to add?</p>\n<p>If you are an Enterprise customer, please feel free to talk to us and suggest new features.</p>\n",
			"date_published": "2022-11-10T10:53:35Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/website-auditing-monitoring/",
			"url": "https://www.sitefig.net/blog/website-auditing-monitoring/",
			"title": "Website monitoring and auditing with Lighthouse",
			"content_html": "<h2 id=\"open-source-made-by-google\" tabindex=\"-1\">Open-source made by Google <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/website-auditing-monitoring/\">#</a></h2>\n<p>Lighthouse is an open-source application developed by Google that can evaluate the performance, technical SEO and accessibility of a webpage.</p>\n<p>If you have never heard from Lighthouse, try it yourself.</p>\n<ul>\n<li>Open Chrome, right-click and select &quot;<code>Inspect</code>&quot;.</li>\n<li>Select the &quot; <code>Lighthouse</code> &quot; tab and click &quot;<code>Analyze page load</code>&quot;.</li>\n</ul>\n<p>It will take a minute to finish, and you'll be presented with a list of failed and passed audits.</p>\n<p><img src=\"https://www.sitefig.net/static/images/Schermafdruk_van_2022_11_07_14_41_20_b58464d422.png\" alt=\"alt\"></p>\n<p>Lighthouse is part of every Chrome browser, and you can run these audits yourself if you want to and have the time and resources to do so.</p>\n<p>But what if you have 1000+ pages? Will you run Lighthouse on each of those?</p>\n<p>Or let's say you have 20 templates? Will the developer test each template and some reference pages with it?</p>\n<p>Most development teams will need more time to run these tests. And I am sure managers prefer expensive developers to focus on other tasks. Right?</p>\n<p>Sitefig uses Lighthouse to audit and monitors all pages on your website using both standard and custom audits.</p>\n<h2 id=\"custom-audit-accessibility\" tabindex=\"-1\">Custom audit accessibility <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/website-auditing-monitoring/\">#</a></h2>\n<p>Accessibility is one of those custom audits because the standard Lighthouse runs only a limited set of audits.</p>\n<p>Our Accessibility audit covers the latest in open-source technology, which we complement with a list of other accessibility issues ranging from identifying emojis to CSS issues that affect accessibility.</p>\n<p>Sitefig also stores screenshots of how the website looks for people with limited vision and color-blindness. <img src=\"https://www.sitefig.net/static/images/sitefig_net_screenshot_663f9fbf75.png\" alt=\"alt\"></p>\n<h2 id=\"custom-audit-for-broken-links\" tabindex=\"-1\">Custom audit for broken links <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/website-auditing-monitoring/\">#</a></h2>\n<p>To ensure Sitefig finds all potential links, we drill deep into the code and HTTP headers to find all likely URLs available on your website.</p>\n<p>Once we have a list of URLs available on your website, all these are verified and retrieved. The broken link check includes audits for broken SSL/TLS certificates, missing DNS, and invalid URL syntax.</p>\n<h2 id=\"standard-performance-audit\" tabindex=\"-1\">Standard Performance audit <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/website-auditing-monitoring/\">#</a></h2>\n<p>The Core web metrics recorded by Lighthouse are lab results based on an actual browser with 1 CPU and 1.5 Gb available memory. The metrics are based on the same hardware and network throughput baseline. That way, Sitefig can reliably compare results between pages and between websites using, avoiding fluctuating real-world conditions.</p>\n<p><img src=\"https://www.sitefig.net/static/images/performance_screen_7de2f13563.png\" alt=\"alt\"></p>\n<p>Besides the lab results, Sitefig also pulls all the real-world data from Google and analyses it to see which pages perform and which do not.</p>\n<h2 id=\"lighthouse-is-a-core-part-of-sitefig\" tabindex=\"-1\">Lighthouse is a core part of Sitefig. <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/website-auditing-monitoring/\">#</a></h2>\n<p>The Lighthouse application is a core part of our crawler and auditing infrastructure.</p>\n<p>It records performance metrics, identifies privacy issues around trackers and cookies, and allows slow-level access to any part of the code of a webpage.</p>\n<p>It is used with standard and custom audits and is loaded using a real browser, Chromium, using the same resources for each run.</p>\n<p>In total, Sitefig runs over 300 audits on each page and website. Allowing the developer to focus on what they do best and leave out the routine checks to Sitefig.</p>\n",
			"date_published": "2022-11-07T13:30:06Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/article-release-v1-1-0/",
			"url": "https://www.sitefig.net/blog/article-release-v1-1-0/",
			"title": "Release v1.1.0",
			"content_html": "<p>We received several customer comments, and release v1.1 is the first update with changes reflecting those requests.</p>\n<p>The update focuses on software architecture, performance, bug fixes and two new report pages.</p>\n<h2 id=\"software-architecture\" tabindex=\"-1\">Software architecture <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h2>\n<p>The Sitefig architecture was built with live updates, allowing 98% uptime.</p>\n<p>At least that is the idea, but we never had a chance to test it.</p>\n<p>Previously we did a lot of updates, which meant downtime, even during the week.</p>\n<p>The previously announced update went well and without any downtime. So we are now confident that we can update the application without interrupting the user experience.</p>\n<h2 id=\"performance\" tabindex=\"-1\">Performance <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h2>\n<p>Many pages did not perform very well, and we believe there is still much room for improvement. At least, that is what the Sitefig report is telling us!</p>\n<p>Yes, we used Sitefig on our application to figure out what needed updating. Which network requests were lagging, and which metric was the worst one?</p>\n<p>TTF (Time to first byte) was the worst metric due to heavy queries and inlined images. The updates in this release reduced the TTF by 75%, which made using the application feel much more fluid.</p>\n<h2 id=\"report-pages\" tabindex=\"-1\">Report pages <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h2>\n<p>Two new report pages were made available to the customer:</p>\n<ul>\n<li>Javascript libraries and vulnerabilities,</li>\n<li>and PDF assets.</li>\n</ul>\n<h3 id=\"javascript-libraries-and-vulnerabilities\" tabindex=\"-1\">Javascript libraries and vulnerabilities <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h3>\n<p>Around 60% of the websites scanned by Sitefig have at least one library with a known vulnerability. The percentage found at Sitefig is much higher than the result Snyk found when scanning popular websites, which was 37%.</p>\n<p>The most common library loaded is still jQuery, even in 2022. And most of those jQuery versions are pretty old. They have not been forgotten due to legacy functionality packed with WordPress plugins or because it was bundled in a more extensive library and never updated.</p>\n<h3 id=\"pdf-assets\" tabindex=\"-1\">PDF Assets <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h3>\n<p>Previously Sitefig did not load any PDf documents and focused only on HTML results. This has changed, and PDF documents are now also loaded and listed.</p>\n<h2 id=\"what-is-next\" tabindex=\"-1\">What is next? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/article-release-v1-1-0/\">#</a></h2>\n<p>We plan to review some of the reports in the next release and update the UI to match a new plan for Sitefig.</p>\n<p>The following features will be coming as well:</p>\n<ul>\n<li>Ticketing integration (Jira, Bugzilla, and … )</li>\n<li>Accessibility audits for PDF documents</li>\n<li>Screenshots for different sizes and devices</li>\n</ul>\n<p>Are you thinking about a feature, need anything specific, drop a comment, and we will contact you to see if we can offer a solution</p>\n",
			"date_published": "2022-11-03T13:30:47Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/pii-data-leaks/",
			"url": "https://www.sitefig.net/blog/pii-data-leaks/",
			"title": "PII Data Leaks: A Dangerous Situation",
			"content_html": "<p>Users/clients and organizations began to focus more on Personal Identifiable Information (PII) and, in general, personal\ndata from 2010 onwards. Personal data controversies raised legal rights issues, ethical obligations, commercial disputes\nand information security concerns.</p>\n<p>2021 wasn’t any different, with more data breaches than ever.</p>\n<p>Indeed, more and more PII is being generated, transferred, and accumulated every day; and it becomes a target for\nhackers of all kinds. Yet, end-users often misjudge the threats, and some organizations believe that social engineering\nis merely a Hollywood plot.</p>\n<h2 id=\"but-what-is-pii\" tabindex=\"-1\">But what is PII? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/pii-data-leaks/\">#</a></h2>\n<p>Personally Identifiable Information (PII) is formally\ndefined (<a href=\"https://www.sitefig.net/blog/pii-data-leaks/%22https:/gdpr.eu/eu-gdpr-personal-data/%22\">https://gdpr.eu/eu-gdpr-personal-data/</a>) as “any information\nrelating to an identified or identifiable natural person (‘data subject’); an identifiable natural person is one who can\nbe identified, directly or indirectly, in particular by reference to an identifier such as a name, an identification\nnumber, location data, an online identifier or to one or more factors specific to the physical, physiological, genetic,\nmental, economic, cultural or social identity of that natural person.”</p>\n<p>Let’s break that down.</p>\n<p>PII is information that organizations use on their own or combined with other information to identify, contact, or\nlocate a single person or identify that individual in context. Personal data comes in many different shapes:</p>\n<ul>\n<li>Names</li>\n<li>Addresses</li>\n<li>Financial information</li>\n<li>Login IDs</li>\n<li>Biometric identifiers</li>\n<li>Video footage</li>\n<li>Geographic location data</li>\n<li>Customer loyalty histories</li>\n<li>Social media</li>\n<li>IP Addresses</li>\n</ul>\n<p>Some of the PII is publicly available and scattered across many websites, but do not underestimate the value of such\ninformation.\nHackers are not only interested in the amount of personal data found but are also interested in the correlation of these\npieces. Public data breaches contain password hashes that can be decrypted using password dictionaries. With a bit of\ntime and enough resources, a hacker can retrieve any password you use on your websites CMS.\nNot many CMS systems enforce password requirements or regular password updates, which means your website can become a\ntarget quickly.\nMost of these attacks are never exposed because you gave the key to the house, and nobody saw any forced entry. As long\nas nothing changes, you might never know. That is why it is essential to be aware of any PII data on your websites and\nhow it can be used against you.</p>\n<h3 id=\"pii-discovery-to-the-rescue\" tabindex=\"-1\">PII Discovery to the rescue <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/pii-data-leaks/\">#</a></h3>\n<p>International companies likely have many websites and limited resources. Manually verifying all those pages becomes a\nnightmare quickly, so best is that you use automated tools to scan your websites such as\nZAP Proxy: the OWASP project has experimental support for PII to scan your website for leaks.CUSPIder: an open-source\nforensic file scanning application that can scan for PII related data.Sitefig: web-governance suite with an extensive\nset of PII scanners to make your website GDPR compliant.Why would you need a PII scanner?Your website is most\nlikely updated right now. If you have a CMS, editors publish new content, and IT delivers updated solutions to suit your\ncompany’s needs. So a regular scan is required to maintain compliance and make sure you avoid embarrassing or costly\nmistakes:\nSave cost: it is better to prevent than to fix. If you can identify all the PII you have on your website on a regular\nbasis, you can mitigate risk before they actually become an issue.Customers trust: the worst UX a visitor can have is\nan email from your company about a data breach but if you do have to send it, make sure you do it within the legal\nrestraints. Under GDPR regulations, your company must to report data breaches within 72 hours.GDPR regulations: to\nmake sure your website adheres to the policy published on your website. Too often policies are published at the start of\nthe project, and never updated. Keep your policies updated with facts so you can either edit the policy or update your\nwebsite functionality and data.\nIt won’t happen at this company.\nWishful thinking isn’t going to change the fact that hackers are hard at work. After servers become online, it takes\nminutes before hackers scan the IP address for vulnerabilities.\nHuman error is a significant factor too, and it accounts for most of the vulnerabilities companies face. No matter how\nstrict your policies are, you cannot rule out human error completely. Scanning regularly makes sure you don’t miss any\nissues.</p>\n<h2 id=\"make-pii-discovery-part-of-the-regular-scan\" tabindex=\"-1\">Make PII discovery part of the regular scan. <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/pii-data-leaks/\">#</a></h2>\n<p>Whether you use open source tools or a free Sitefig account, any company with several websites should take care to scan\nfor potentially damaging or necessary PII data. It is impossible to rule out publishing names and email addresses;\ntelephone numbers and even bank account need to be published in some cases.\nSet up a regular scanning solution to keep your reputation intact and stay compliant.</p>\n",
			"date_published": "2022-11-03T13:29:29Z"
		}
		,
		{
			"id": "https://www.sitefig.net/blog/why-you-need-https/",
			"url": "https://www.sitefig.net/blog/why-you-need-https/",
			"title": "Why you need HTTPS",
			"content_html": "<h2 id=\"everything-you-need-to-know-about-securing-your-website\" tabindex=\"-1\">Everything you need to know about securing your website <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<p>All websites these days should use HTTPS (Hypertext Transfer Protocol Secure).\\nYes, there was a time TLS (Transport Layer Security) certificates were unnecessary, but today you really cannot go without them. Here is why!\n<a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/nl.wikipedia.org/wiki/Hypertext_Transfer_Protocol_Secure%22\">HTTPS</a> is the encrypted version of HTTP (Hypertext Transfer Protocol), the protocol used for transferring data to your browsers. The HTTPS protocol relies on a TLS certificate to encrypt all the data between your computer and the server. As a result, HTTPS prevents anyone from tampering with the data and ensures content integrity, and it works both ways: when receiving and sending data such as usernames, passwords and visa card numbers.\nThe benefits of having a secured website far outweigh the downsides, which range from personal data loss, website impersonation attacks and lawsuits brought to you by any DPA (Data Protection Authority) in Europe.\nFor example, in 2021, <a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/edpb.europa.eu/news/national-news/2021/dutch-dpa-orthodontic-practice-fined-unsecured-patient-website_en%22\">the Dutch DPA imposed a €12,000 fine</a> on an orthodontic practice for allowing new patients to register on an unsecured website.\nWe can obtain TLS certificates for free, which means paying that hefty price was unnecessary.</p>\n<h2 id=\"the-benefits-of-a-secure-website\" tabindex=\"-1\">The benefits of a secure website <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<h3 id=\"security\" tabindex=\"-1\">Security <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h3>\n<p>With HTTPS, intruders can’t manipulate or passively listen in on the communications between your site and your users. An HTTPS connection provides additional security and privacy for your company and customers.\nThe encryption makes it practically impossible to eavesdrop or snoop on any communication. While your customers are online, browsing or entering sensitive data on your website, nobody will be able to track what they are doing.\nAdditionally, the company operating the website can be sure that no 3rd party is making changes to the website and the customer effectively sees the website as expected. You might be surprised how many companies have injected marketing messages, advertising, script and images onto pages browsed on open WiFi networks. It happened pretty often.\nLuckily the need for privacy increased, and TLS certificates became much more common. Most of the <a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/trends.builtwith.com/ssl%22\">websites in the top 1 million are now using HTTPS</a> .\nThe certificate is also a means of authentication and proves that your user sees and uses the intended website.\n<img src=\"https://www.sitefig.net/blog/why-you-need-https/%22/img/J4_aFtD2N6-300.png%22\" alt=\"alt\"></p>\n<h3 id=\"privacy-and-trust\" tabindex=\"-1\">Privacy and trust <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h3>\n<p>Besides security for your company and your customer, privacy concerns have become the focal point of several new directives and legislation efforts worldwide.\nWe already mentioned the need to use HTTP to avoid anyone snooping n the communication between your website and the customers’ browser. Here is why that is important.\nIn 2021 a complaint was lodged to the Dutch DPA about the website of an orthodontic practice. The registration forms on the website in question asked for all kinds of personal data about the patient’s health.\nUnfortunately, the form was not on a secure connection, and it potentially exposed the data to anyone who had access to the network.\nAs the orthodontic practice had many patients and a large number of under-aged patients, the DPA decided to impose a hefty fine for not complying with the GDPR directive.\nIf you have forms on your website on an insecure connection (HTTP), the transmitted data can potentially be tracked by hackers.\nThis kind of data breach is difficult to detect, but you are still liable and need to report any data breaches in the next 72 hours as a company as per the GDPR directive.\nThe GDPR directive states that data processing must be handled in such a way as to ensure appropriate security, integrity, and confidentiality (e.g. by using encryption).\nThe GDPR documents, here and here, explicitly define the need for encryption, though no article expressly documents the usage of a TLS certificate on your website.\nSo, in theory, you don’t need it. In practice, though, it is strongly recommended as it conveys trust and keeps prying eyes away.</p>\n<h2 id=\"seo-and-google\" tabindex=\"-1\">SEO and Google <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<p>Before GDPR, security and data breaches were on everybody’s radar, SEO improvements were the main benefit of having a secure website. Over the last ten years, Google made several efforts to push SSL certificates, and today it is the defacto standard for websites.</p>\n<h3 id=\"a-weak-ranking-signal\" tabindex=\"-1\">A weak ranking signal <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h3>\n<p>Earlier in 2014, Google already documented that HTTPS was a weak signal which could improve your position on the SERPs.\\n<a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/developers.google.com/search/blog/2014/08/https-as-ranking-signal%22\">Developers google : https as ranking signal</a>\nHaving a TLS certificate does not mean your website automatically gets on the first page of Google. But if you are competing for a specific keyword, and your competitor’s website is not on HTTPS, it might just be the tiebreaker.</p>\n<h3 id=\"google-chrome-thinks-your-website-is-not-secure\" tabindex=\"-1\">Google Chrome thinks your website is “not secure” <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h3>\n<p>Insecure website showing &quot;Not secured&quot; in the URL bar of the brwoser.\\nIn July 2018, Google Chrome started labelling websites lacking an SSL certificate as “not secure”. In addition to Chrome, other browsers have implemented similar notifications for sites without valid SSL certificates.\nIn other words, Google actively pushes websites to set up HTTPS. And since most if not all browsers are these days based on Chrome, it is the defacto standard.\nTrust is still important for whether customers purchase goods online or not. Last year the UN reported that at least 30 % of users are unwilling to buy online due to a lack of trust. So if your website is actively labelled as untrustworthy, it isn’t going to do you any good.</p>\n<h2 id=\"downsides\" tabindex=\"-1\">Downsides? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<p>Did we mention that the cost of obtaining a certificate is free?\\nIf you’d like to win an argument with someone, visit <a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/doesmysiteneedhttps.com/%22\">https://doesmysiteneedhttps.com/</a></p>\n<h2 id=\"how-to-set-up-https-for-your-website\" tabindex=\"-1\">How to set up HTTPS for your website? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<p>Today, the easiest way to enable HTTPS is to move your DNS to Cloudflare. Unfortunately, that does not mean the website is entirely secure.\nThe webserver running the website still requires a TLS certificate to enable traffic between Cloudflare and your server to be encrypted.\nCloudflare does provide certificates to fix that issue, but there are other options such as Let’s encrypt or Zerrossl.</p>\n<h2 id=\"how-to-check-for-potential-mistakes\" tabindex=\"-1\">How to check for potential mistakes? <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h2>\n<p>Once you have your website set up or migrated to HTTPS, it is easy to make mistakes.\nIt might be that a redirect points to an HTTP URL, an incorrectly configured subdomain is still on HTTP, invalid canonical tags, or your SSL certificate is simply out of date.\nThere are plenty of mistakes that can happen, and it is easy to check for common SSL mistakes.</p>\n<h3 id=\"check-for-http-pages-and-links\" tabindex=\"-1\">Check for HTTP pages and links: <a class=\"header-anchor\" href=\"https://www.sitefig.net/blog/why-you-need-https/\">#</a></h3>\n<p><strong>With Google operators</strong>\nYou can make your search very specific. You can search for all pages on your website indexed by Google that use the HTTP protocol in the URL:\nTry it: “<a href=\"https://www.sitefig.net/blog/why-you-need-https/%22https:/www.google.com/search\">site:sitefig.eu inurl:http://</a>”\n<img src=\"https://www.sitefig.net/blog/why-you-need-https/%22/img/ykgOGKc5Av-300.png%22\" alt=\"alt\">\n<strong>A free account with Sitefig</strong>\nSign up for a free Sitefig account and you’ll get access to all the broken links and resources on your website. Each page will be tested to ensure that it redirects to an HTTPS page.\n<img src=\"https://www.sitefig.net/blog/why-you-need-https/%22/img/r2hR0iNlW4-300.png%22\" alt=\"alt\">\n&quot;</p>\n",
			"date_published": "2022-11-03T11:16:35Z"
		}
		
	]
}
